<!DOCTYPE html>
<html lang="">
  <head>
    <meta charset="UTF-8" />
    <meta content="text/html; charset=utf-8" http-equiv="Content-Type" />
    <title>数据沿袭基本指南(2022 年) · GitBook</title>
    <meta http-equiv="X-UA-Compatible" content="IE=edge" />
    <meta name="description" content="" />
    <meta name="generator" content="GitBook 3.2.3" />

    <link rel="stylesheet" href="../../gitbook/style.css" />

    <link
      rel="stylesheet"
      href="../../gitbook/gitbook-plugin-highlight/website.css"
    />

    <link
      rel="stylesheet"
      href="../../gitbook/gitbook-plugin-search/search.css"
    />

    <link
      rel="stylesheet"
      href="../../gitbook/gitbook-plugin-fontsettings/website.css"
    />

    <meta name="HandheldFriendly" content="true" />
    <meta
      name="viewport"
      content="width=device-width, initial-scale=1, user-scalable=no"
    />
    <meta name="apple-mobile-web-app-capable" content="yes" />
    <meta name="apple-mobile-web-app-status-bar-style" content="black" />
    <link
      rel="apple-touch-icon-precomposed"
      sizes="152x152"
      href="../../gitbook/images/apple-touch-icon-precomposed-152.png"
    />
    <link
      rel="shortcut icon"
      href="../../gitbook/images/favicon.ico"
      type="image/x-icon"
    />
  </head>
  <body>
    <div class="book">
      <div class="book-summary">
        <div id="book-search-input" role="search">
          <input type="text" placeholder="Type to search" />
        </div>

        <nav role="navigation">
          <ul class="summary">
            <li class="chapter" data-level="1.1" data-path="../../">
              <a href="../../"> 全站导航 </a>
            </li>

            <li class="chapter" data-level="1.2">
              <span> 文字杂录 </span>

              <ul class="articles">
                <li
                  class="chapter active"
                  data-level="1.2.1"
                  data-path="The-Essential-Guide-to-DATA-LINEAGE-IN-2022.html"
                >
                  <a href="The-Essential-Guide-to-DATA-LINEAGE-IN-2022.html">
                    数据沿袭基本指南(2022 年)
                  </a>
                </li>
              </ul>
            </li>

            <li class="chapter" data-level="1.3">
              <span> 在线图书 </span>

              <ul class="articles">
                <li class="chapter" data-level="1.3.1">
                  <a
                    target="_blank"
                    href="https://introduction-nlp.book.jaden.tech/"
                  >
                    自然语言处理入门
                  </a>
                </li>

                <li class="chapter" data-level="1.3.2">
                  <a
                    target="_blank"
                    href="https://python-for-data-analysis-2nd.book.jaden.tech/"
                  >
                    利用 Python 进行数据分析[第 2 版]
                  </a>
                </li>
              </ul>
            </li>

            <li class="divider"></li>

            <li>
              <a
                href="https://www.gitbook.com"
                target="blank"
                class="gitbook-link"
              >
                晚知胜于无知
              </a>
            </li>
          </ul>
        </nav>
      </div>

      <div class="book-body">
        <div class="body-inner">
          <div class="book-header" role="navigation">
            <!-- Title -->
            <h1>
              <i class="fa fa-circle-o-notch fa-spin"></i>
              <a href="../..">数据沿袭基本指南(2022 年)</a>
            </h1>
          </div>

          <div class="page-wrapper" tabindex="-1" role="main">
            <div class="page-inner">
              <div id="book-search-results">
                <div class="search-noresults">
                  <section class="normal markdown-section">
                    <h1
                      id="&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x57FA;&#x672C;&#x6307;&#x5357;2022-&#x5E74;"
                    >
                      &#x6570;&#x636E;&#x6CBF;&#x88AD;&#x57FA;&#x672C;&#x6307;&#x5357;(2022
                      &#x5E74;)
                    </h1>
                    <blockquote>
                      <p>
                        &#x539F;&#x6587;&#x94FE;&#x63A5;&#xFF1A;<a
                          target="_blank"
                          href="The_Essential_Guide_to_Data_Lineage_in_2022.pdf"
                          >The Essential Guide to DATA LINEAGE IN 2022</a
                        >
                      </p>
                      <p>
                        &#x7FFB;&#x8BD1;&#x65E5;&#x671F;&#xFF1A;2022 &#x5E74; 02
                        &#x6708; 26 &#x65E5;
                      </p>
                    </blockquote>
                    <h2
                      id="&#x4EC0;&#x4E48;&#x662F;&#x6570;&#x636E;&#x6CBF;&#x88AD;"
                    >
                      &#x4EC0;&#x4E48;&#x662F;&#x6570;&#x636E;&#x6CBF;&#x88AD;?
                    </h2>
                    <blockquote>
                      <p>What Is Data Lineage?</p>
                    </blockquote>
                    <p>
                      &#x6570;&#x636E;&#x6CBF;&#x88AD;&#x80CC;&#x540E;&#x7684;&#x6838;&#x5FC3;&#x601D;&#x60F3;&#x662F;&#x5145;&#x5206;&#x7406;&#x89E3;&#x6570;&#x636E;&#x5982;&#x4F55;&#x5728;&#x5177;&#x5907;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x548C;&#x5904;&#x7406;&#x80FD;&#x529B;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x95F4;&#x4ECE;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x6D41;&#x8F6C;&#x81F3;&#x53E6;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x3002;&#x8FD9;&#x4F3C;&#x4E4E;&#x4E0D;&#x5E94;&#x8BE5;&#x662F;&#x4E00;&#x4E2A;&#x56F0;&#x96BE;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x4E8B;&#x5B9E;&#x786E;&#x5B9E;&#x5982;&#x6B64;&#x3002;&#x9762;&#x5BF9;
                      2022
                      &#x5E74;&#x53CA;&#x672A;&#x6765;&#xFF0C;&#x6B64;&#x7C7B;&#x95EE;&#x9898;&#x5BF9;&#x7EC4;&#x7EC7;&#x6765;&#x8BF4;&#x662F;&#x4E00;&#x4E2A;&#x8270;&#x96BE;&#x7684;&#x95EE;&#x9898;&#x3002;&#x5982;&#x679C;&#x7EC4;&#x7EC7;&#x4E0D;&#x77E5;&#x9053;&#x4ED6;&#x4EEC;&#x7684;&#x6570;&#x636E;&#x4ECE;&#x54EA;&#x91CC;&#x6765;&#x6216;&#x5F80;&#x54EA;&#x91CC;&#x53BB;&#xFF0C;&#x5219;&#x7531;&#x6B64;&#x4EA7;&#x751F;&#x8BB8;&#x591A;&#x4E0D;&#x540C;&#x5C42;&#x9762;&#x7684;&#x98CE;&#x9669;&#xFF0C;&#x6570;&#x636E;&#x73AF;&#x5883;&#x7684;&#x7A33;&#x5B9A;&#x6027;&#x81EA;&#x7136;&#x4E5F;&#x96BE;&#x4EE5;&#x4FDD;&#x969C;&#x3002;&#x4E0D;&#x7A33;&#x5B9A;&#x7684;&#x6570;&#x636E;&#x73AF;&#x5883;&#x610F;&#x5473;&#x7740;&#x96BE;&#x4EE5;&#x4ECE;&#x6570;&#x636E;&#x4E2D;&#x63D0;&#x53D6;&#x4EF7;&#x503C;&#xFF0C;&#x800C;&#x6570;&#x636E;&#x5C31;&#x662F;&#x65B0;&#x578B;&#x77F3;&#x6CB9;&#x6216;&#x65B0;&#x578B;&#x9EC4;&#x91D1;&#x3002;&#x8FD9;&#x4E9B;&#x6CA1;&#x6709;&#x80FD;&#x529B;&#x4ECE;&#x6570;&#x636E;&#x4E2D;&#x63D0;&#x53D6;&#x4EF7;&#x503C;&#x7684;&#x7EC4;&#x7EC7;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x5728;&#x5546;&#x4E1A;&#x7ADE;&#x4E89;&#x4E2D;&#x88AB;&#x90A3;&#x4E9B;&#x6709;&#x80FD;&#x529B;&#x63D0;&#x53D6;&#x6570;&#x636E;&#x4EF7;&#x503C;&#x7684;&#x7EC4;&#x7EC7;&#x6240;&#x53D6;&#x4EE3;&#x3002;
                    </p>
                    <blockquote>
                      <p>
                        The core idea behind data lineage is the ability to
                        fully understand how data flows from one place to
                        another within the infrastructure that was built to
                        house and process it. It seems like it should not be a
                        difficult problem, but it is. In fact, it is a huge
                        issue for organizations as they face 2022 and beyond. If
                        organizations do not know where their data comes from or
                        goes, they have uncontrolled environments that have risk
                        on many different levels. Having uncontrolled data
                        environments means that it is also very difficult to
                        extract value from data, and data is the new oil or new
                        gold. Organizations that cannot extract value from data
                        stand a good chance of being outcompeted and replaced by
                        organizations that can.
                      </p>
                    </blockquote>
                    <p>
                      &#x7EFC;&#x89C2;&#x5F53;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x73B0;&#x4EE3;&#x6280;&#x672F;&#x6587;&#x660E;&#x5145;&#x6EE1;&#x4E86;&#x8BA9;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x53D8;&#x5F97;&#x7B80;&#x5355;&#x7684;&#x4F8B;&#x5B50;&#x3002;&#x6BD4;&#x5982;&#x70BC;&#x6CB9;&#x5382;&#x662F;&#x4E00;&#x4E2A;&#x5927;&#x578B;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#xFF0C;&#x6309;&#x7167;&#x7CBE;&#x786E;&#x7684;&#x89C4;&#x683C;&#x8FDB;&#x884C;&#x5EFA;&#x9020;&#xFF0C;&#x64CD;&#x4F5C;&#x4EBA;&#x5458;&#x5F88;&#x6E05;&#x695A;&#x5730;&#x77E5;&#x9053;&#x90A3;&#x4E9B;&#x6D41;&#x6C34;&#x7EBF;&#x4E2D;&#x7684;&#x6DB2;&#x4F53;&#x4EA7;&#x54C1;&#x5728;&#x53D1;&#x751F;&#x7740;&#x4EC0;&#x4E48;&#x5316;&#x5B66;&#x53CD;&#x5E94;&#x3001;&#x6709;&#x591A;&#x4E48;&#x5730;&#x5371;&#x9669;&#x2014;&#x2014;&#x8BDA;&#x7136;&#xFF0C;&#x6781;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x60B2;&#x5267;&#x8FD8;&#x662F;&#x4F1A;&#x65F6;&#x6709;&#x53D1;&#x751F;&#x3002;&#x73B0;&#x4EE3;&#x901A;&#x4FE1;&#x7F51;&#x7EDC;&#x662F;&#x590D;&#x6742;&#x5DE5;&#x7A0B;&#x80CC;&#x666F;&#x4E0B;&#x7684;&#x4E00;&#x4E2A;&#x7CBE;&#x5999;&#x6848;&#x4F8B;&#xFF0C;&#x5B83;&#x7531;&#x7F51;&#x7EDC;&#x8FD0;&#x8425;&#x4E2D;&#x5FC3;(NOCs)&#x5B8C;&#x5168;&#x63A7;&#x5236;&#xFF0C;&#x7535;&#x8BDD;&#x4FE1;&#x53F7;&#x4ECE;&#x51FA;&#x53D1;&#x5730;&#x7545;&#x901A;&#x65E0;&#x963B;&#x5730;&#x4F20;&#x8F93;&#x5230;&#x76EE;&#x7684;&#x5730;&#x3002;
                    </p>
                    <blockquote>
                      <p>
                        Our modern technological civilization is full of
                        examples that would make data lineage seem easy by
                        comparison. An oil refinery is a gigantic piece of
                        infrastructure, built to a precise specification, where
                        the operators know exactly what is happening with the
                        liquid products flowing through it &#x2013; admittedly
                        with a few very rare, and sometimes tragic, exceptions.
                        Modern telephone networks are another exquisite example
                        of complex engineering, being fully controlled from
                        Network Operating Centers (NOCs) so that calls go
                        through from origin to destination without a hitch.
                      </p>
                    </blockquote>
                    <p>
                      &#x6211;&#x4EEC;&#x627F;&#x8BA4;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x96BE;&#x89E3;&#x51B3;&#x7684;&#x68D8;&#x624B;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x5230;&#x5E95;&#x662F;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x8981;&#x56DE;&#x7B54;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x60F3;&#x50CF;&#x4E00;&#x4E0B;&#x516C;&#x53F8;&#x9632;&#x706B;&#x5899;&#x7B2C;&#x4E00;&#x9053;&#x5173;&#x5361;&#x6355;&#x83B7;&#x5230;&#x7684;&#x6570;&#x636E;&#x9879;&#xFF0C;&#x4E5F;&#x8BB8;&#x5B83;&#x4EEC;&#x662F;&#x6B63;&#x5E38;&#x7684;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x3002;&#x6570;&#x636E;&#x88AB;&#x5C31;&#x5730;&#x4FDD;&#x5B58;&#x5E76;&#x4E0D;&#x518D;&#x7EF4;&#x62A4;&#x7684;&#x65F6;&#x4EE3;&#x65E9;&#x5DF2;&#x8FC7;&#x53BB;&#xFF0C;&#x81EA;&#x7136;&#x800C;&#x7136;&#xFF0C;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x9879;&#x4F1A;&#x88AB;&#x4F20;&#x8F93;&#x5230;&#x5176;&#x4ED6;&#x6570;&#x636E;&#x5E73;&#x53F0;&#xFF08;&#x6570;&#x636E;&#x5E93;&#x6216;&#x6587;&#x4EF6;&#xFF09;&#xFF0C;&#x9632;&#x706B;&#x5899;&#x6355;&#x83B7;&#x7684;&#x6570;&#x636E;&#x9879;&#x4E0D;&#x65AD;&#x8FFD;&#x52A0;&#xFF0C;&#x76F4;&#x5230;&#x67D0;&#x4E00;&#x65F6;&#x523B;&#xFF0C;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x4F1A;&#x88AB;&#x5904;&#x7406;&#x3001;&#x8F6C;&#x6362;&#x6210;&#x4E00;&#x4EFD;&#x4EFD;&#x6570;&#x636E;&#x4FE1;&#x606F;&#x62A5;&#x544A;&#xFF0C;&#x62A5;&#x544A;&#x4E3B;&#x9898;&#x53EF;&#x80FD;&#x662F;&#x6570;&#x636E;&#x6D88;&#x8D39;&#x5E73;&#x53F0;&#x3001;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x751A;&#x81F3;&#x9762;&#x5411;&#x5BA2;&#x6237;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x968F;&#x7740;&#x6570;&#x636E;&#x9879;&#x7684;&#x8FC1;&#x79FB;&#x6D41;&#x8F6C;&#xFF0C;&#x5B83;&#x53EF;&#x80FD;&#x4F1A;&#x88AB;&#x590D;&#x5236;&#xFF0C;&#x6216;&#x8005;&#x88AB;&#x6807;&#x51C6;&#x5316;&#x5904;&#x7406;&#xFF0C;&#x6216;&#x8005;&#x88AB;&#x7528;&#x4E8E;&#x7EDF;&#x8BA1;&#x6574;&#x4F53;&#x6570;&#x636E;&#x73AF;&#x5883;&#x7684;&#x6307;&#x6807;&#x3002;&#x4E0A;&#x8FF0;&#x63CF;&#x8FF0;&#x7684;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x9879;&#x7684;&#x7ECF;&#x5386;&#x2014;&#x2014;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x5728;&#x54EA;&#x91CC;&#x3001;&#x8FC1;&#x79FB;&#x6D41;&#x8F6C;&#x7684;&#x8DEF;&#x5F84;&#x3001;&#x8BE5;&#x8FC7;&#x7A0B;&#x4E2D;&#x6570;&#x636E;&#x53D1;&#x751F;&#x4E86;&#x4EC0;&#x4E48;&#x53D8;&#x5316;&#xFF0C;&#x5B83;&#x53C8;&#x5982;&#x4F55;&#x6210;&#x4E3A;&#x5176;&#x4ED6;&#x6570;&#x636E;&#x9879;&#x7684;&#x6784;&#x6210;&#x90E8;&#x5206;&#xFF0C;&#x4EE5;&#x53CA;&#x5B83;&#x5728;&#x4E0D;&#x540C;&#x6570;&#x636E;&#x6D88;&#x8D39;&#x5E73;&#x53F0;&#x4E2D;&#x51FA;&#x73B0;&#x7684;&#x4F4D;&#x7F6E;&#x2014;&#x2014;&#x8FD9;&#x4E9B;&#x5185;&#x5BB9;&#x6784;&#x6210;&#x4E86;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x3002;
                    </p>
                    <blockquote>
                      <p>
                        We can agree that data lineage is a hard problem to
                        solve, but just what is it? To answer this, think of an
                        item of data being captured for the first time within
                        the firewalls of an organization, perhaps via data
                        entry. The days when data stayed put in the same silo
                        where it was first captured are long gone. Inevitably,
                        the item of data will be sent to other data stores
                        (databases or files), and from these to yet more, until
                        finally, our item of data ends up as a piece of
                        information in one or more data consumption platforms
                        such as reports, operational systems or even customer
                        facing applications. As the data item travels it may be
                        replicated, or transformed to standardize it, or used in
                        calculations to generate other data elements that enrich
                        the overall data environment. All of this &#x2013; where
                        the data is stored, the pathways it travels, the changes
                        that happen to it along the way, how it becomes a
                        constituent of other data, and where it appears in the
                        various data consumption platforms &#x2013; make up data
                        lineage.
                      </p>
                    </blockquote>
                    <h2
                      id="&#x7406;&#x89E3;&#x6C34;&#x5E73;&#x548C;&#x5782;&#x76F4;&#x6570;&#x636E;&#x6CBF;&#x88AD;"
                    >
                      &#x7406;&#x89E3;&#x6C34;&#x5E73;&#x548C;&#x5782;&#x76F4;&#x6570;&#x636E;&#x6CBF;&#x88AD;
                    </h2>
                    <blockquote>
                      <p>Understanding Horizontal and Vertical Data Lineage</p>
                    </blockquote>
                    <p>
                      &#x7136;&#x800C;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x610F;&#x8BC6;&#x5230;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x7279;&#x6027;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x5B58;&#x5728;&#x4E8E;&#x4E0D;&#x540C;&#x7684;&#x5C42;&#x6B21;&#xFF0C;&#x6BCF;&#x4E2A;&#x5C42;&#x6B21;&#x90FD;&#x6709;&#x5176;&#x72EC;&#x6709;&#x7684;&#x7279;&#x70B9;&#x548C;&#x4EF7;&#x503C;&#x3002;
                    </p>
                    <blockquote>
                      <p>
                        Yet there is another twist to data lineage we need to
                        appreciate. It can exist at different levels, each of
                        which has its own particular characteristics and value.
                      </p>
                    </blockquote>
                    <p>
                      &#x6570;&#x636E;&#x6CBF;&#x88AD;&#x9996;&#x5148;&#x4EE5;&#x624B;&#x5DE5;&#x8BB0;&#x5F55;&#x5165;&#x6863;&#x7684;&#x65B9;&#x5F0F;&#x5728;&#x7CFB;&#x7EDF;&#x4E4B;&#x95F4;&#x6D41;&#x8F6C;&#xFF0C;&#x4ECE;&#x9AD8;&#x5EA6;&#x62BD;&#x8C61;&#x7684;&#x7EF4;&#x5EA6;&#x6765;&#x7406;&#x89E3;&#xFF0C;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x8FD9;&#x662F;&#x6C34;&#x5E73;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#xFF0C;&#x901A;&#x5E38;&#x662F;&#x6570;&#x636E;&#x96C6;&#x7C92;&#x5EA6;&#x3002;&#x5B83;&#x7684;&#x4F18;&#x70B9;&#x662F;&#x63D0;&#x4F9B;&#x4E00;&#x518C;&#x5927;&#x4F53;&#x79EF;&#x7684;&#x56FE;&#x6587;&#xFF0C;&#x7528;&#x6765;&#x5C55;&#x793A;&#x5BA2;&#x6237;&#x6570;&#x636E;&#x5728;&#x7EC4;&#x7EC7;&#x7CFB;&#x7EDF;&#x4E4B;&#x95F4;&#x662F;&#x5982;&#x4F55;&#x6D41;&#x52A8;&#x7684;&#x3002;&#x5C31;&#x76EE;&#x524D;&#x800C;&#x8A00;&#xFF0C;&#x8FD9;&#x7C7B;&#x6570;&#x636E;&#x5BF9;&#x67B6;&#x6784;&#x5E08;&#x548C;&#x4E1A;&#x52A1;&#x7528;&#x6237;&#x6709;&#x5F88;&#x5927;&#x7684;&#x5E2E;&#x52A9;&#x3002;&#x4F46;&#x662F;&#x5728;&#x5F88;&#x591A;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x65E0;&#x6CD5;&#x6EE1;&#x8DB3;&#x57FA;&#x4E8E;&#x67D0;&#x4E2A;&#x6570;&#x636E;&#x9879;&#x5207;&#x5165;&#x5E76;&#x7EE7;&#x7EED;&#x6DF1;&#x5165;&#x6316;&#x6398;&#x7684;&#x9700;&#x6C42;&#x3002;&#x6B64;&#x65F6;&#x5782;&#x76F4;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x5C31;&#x51FA;&#x73B0;&#x4E86;&#xFF0C;&#x5BF9;&#x4E8E;&#x5782;&#x76F4;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x9010;&#x5C42;&#x5730;&#x5206;&#x6790;&#x6570;&#x636E;&#x7EC6;&#x8282;&#xFF0C;&#x76F4;&#x5230;&#x6EE1;&#x8DB3;&#x6570;&#x636E;&#x5206;&#x6790;&#x7684;&#x76EE;&#x7684;&#xFF0C;&#x5373;&#x9010;&#x5217;&#x5730;&#x5206;&#x6790;&#x6570;&#x636E;&#xFF08;&#x6216;&#x5217;&#x6570;&#x636E;&#x62A5;&#x544A;&#xFF09;&#x5728;&#x8FC1;&#x79FB;&#x8FC7;&#x7A0B;&#x4E2D;&#x7684;&#x8F6C;&#x6362;&#x5904;&#x7406;&#x3002;
                    </p>
                    <blockquote>
                      <p>
                        Data lineage was first documented manually as overall
                        flows between systems. This high level, known as
                        horizontal data lineage, is usually at the dataset
                        level. It has the advantage of providing a big picture,
                        showing, say, how customer data flows among the
                        organization&#x2019;s systems. This is of enormous help
                        to architects and business users &#x2013; as far as it
                        goes. But in many cases, it does not go far enough and
                        there are many times when we need to pick a point in the
                        horizontal data lineage and dig deeper. This is where
                        vertical data lineage comes in. With vertical data
                        lineage, we go through successive layers of detail until
                        we get to the ultimate level, which is column-to-column
                        (or column-to-report element) plus the transformations
                        that happen at each of these units of data movement.
                      </p>
                      <p>
                        &#x5782;&#x76F4;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x53EF;&#x4EE5;&#x56DE;&#x7B54;&#x8BF8;&#x5982;&#x62A5;&#x8868;&#x4E2D;&#x7279;&#x5B9A;&#x5355;&#x5143;&#x9879;&#x6570;&#x636E;&#x503C;&#x7684;&#x6765;&#x6E90;&#xFF0C;&#x6216;&#x8005;&#x6570;&#x636E;&#x503C;&#x5728;&#x4E24;&#x5217;&#x6570;&#x636E;&#x4E4B;&#x95F4;&#x6D41;&#x8F6C;&#x65F6;&#x7684;&#x8BA1;&#x7B97;&#x903B;&#x8F91;&#x7B49;&#x95EE;&#x9898;&#x3002;&#x5BF9;&#x4E8E;&#x50CF;
                        BI
                        &#x5206;&#x6790;&#x5E08;&#x8FD9;&#x6837;&#x8BD5;&#x56FE;&#x89E3;&#x51B3;&#x6570;&#x636E;&#x62A5;&#x544A;&#x4E2D;&#x6307;&#x6807;&#x503C;&#x5F02;&#x5E38;&#x7684;&#x4EBA;&#x5458;&#xFF0C;&#x6216;&#x8005;&#x8BD5;&#x56FE;&#x660E;&#x786E;&#x5E73;&#x53F0;&#x8FC1;&#x79FB;&#x65F6;&#x6570;&#x636E;&#x5F71;&#x54CD;&#x8303;&#x56F4;&#x7684;&#x6570;&#x636E;&#x5206;&#x6790;&#x5E08;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x662F;&#x5F88;&#x6709;&#x6709;&#x7528;&#x7684;&#x3002;
                      </p>
                      <p>
                        Vertical data lineage answers questions such as where a
                        particular data value in a report came from, or how a
                        data value is transformed as it flows between two
                        columns. It is useful to people like BI Analysts trying
                        to solve a report discrepancy, or data analysts trying
                        to understand the true scope of what exists in an
                        environment that is to be migrated to a new platform.
                      </p>
                    </blockquote>
                    <h2
                      id="&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x4E0E;&#x4E1A;&#x52A1;&#x6D41;&#x7A0B;"
                    >
                      &#x6570;&#x636E;&#x6CBF;&#x88AD;&#x4E0E;&#x4E1A;&#x52A1;&#x6D41;&#x7A0B;
                    </h2>
                    <blockquote>
                      <p>Data Lineage and Business Processes</p>
                    </blockquote>
                    <p>
                      &#x76EE;&#x524D;&#x4E3A;&#x6B62;&#xFF0C;&#x672C;&#x6587;&#x5DF2;&#x7ECF;&#x89E3;&#x91CA;&#x4E86;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x6982;&#x5FF5;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x6C34;&#x5E73;&#x6CBF;&#x88AD;&#x548C;&#x5782;&#x76F4;&#x6CBF;&#x88AD;&#xFF0C;&#x5E76;&#x4E14;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x884C;&#x4E3A;&#x4E00;&#x76F4;&#x90FD;&#x5728;&#x7CFB;&#x7EDF;&#x4E0E;&#x6570;&#x636E;&#x5BF9;&#x8C61;&#x73AF;&#x5883;&#x4E2D;&#x65F6;&#x65F6;&#x523B;&#x523B;&#x5730;&#x53D1;&#x751F;&#x7740;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x7ECF;&#x5E38;&#x88AB;&#x5FFD;&#x89C6;&#x4F46;&#x6781;&#x5176;&#x91CD;&#x8981;&#x7684;&#x56E0;&#x7D20;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x80FD;&#x591F;&#x89E3;&#x8BFB;&#x5E76;&#x4F53;&#x73B0;&#x4E00;&#x4E2A;&#x7EC4;&#x7EC7;&#x4E2D;&#x7684;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x4E1A;&#x52A1;&#x6D41;&#x7A0B;&#x3002;
                    </p>
                    <blockquote>
                      <p>
                        So far we have described data lineage and how it can be
                        horizontal and vertical, but this has been done in the
                        context of systems and data objects. But there is
                        another frequently overlooked, but extremely important,
                        aspect of data lineage. Data lineage represents a good
                        deal of the business processes that occur in an
                        organization.
                      </p>
                    </blockquote>
                    <p>
                      &#x4E92;&#x8054;&#x7F51;&#x65F6;&#x4EE3;&#x4E4B;&#x524D;&#xFF0C;&#x7EC4;&#x7EC7;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x4E1A;&#x52A1;&#x6D41;&#x7A0B;&#x90FD;&#x662F;&#x4EBA;&#x5DE5;&#x7EF4;&#x62A4;&#x7684;&#xFF0C;&#x5C06;&#x6570;&#x636E;&#x4FE1;&#x606F;&#x4ECE;&#x4E00;&#x4E2A;&#x4EBA;&#xFF08;&#x6216;&#x90E8;&#x95E8;&#xFF09;&#x4F20;&#x9012;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x4EBA;&#x3002;&#x5982;&#x4ECA;&#xFF0C;&#x6D41;&#x7A0B;&#x5904;&#x7406;&#x65B9;&#x5F0F;&#x5168;&#x90E8;&#x9769;&#x65B0;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;
                      &#x8BA4;&#x4E3A;&#xFF0C;IT
                      &#x7CFB;&#x7EDF;&#x5DF2;&#x7ECF;&#x53D6;&#x4EE3;&#x4E86;&#x4EBA;&#x5DE5;&#x8FDB;&#x884C;&#x4E1A;&#x52A1;&#x5904;&#x7406;&#xFF0C;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x4F5C;&#x4E3A;&#x65B0;&#x7684;&#x5904;&#x7406;&#x65B9;&#x5F0F;&#x5728;&#x4EBA;&#x5458;&#x6216;&#x90E8;&#x95E8;&#x4E4B;&#x95F4;&#x4F20;&#x9001;&#x4FE1;&#x606F;&#x3002;&#x7EC4;&#x7EC7;&#x5E94;&#x8BE5;&#x81EA;&#x6211;&#x590D;&#x76D8;&#x8FDB;&#x884C;&#x786E;&#x8BA4;&#xFF0C;&#x901A;&#x8FC7;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x6316;&#x6398;&#x4E1A;&#x52A1;&#x4EF7;&#x503C;&#x94FE;&#x5C31;&#x662F;&#x5B8C;&#x5584;&#x4E1A;&#x52A1;&#x6D41;&#x7A0B;&#x7684;&#x6700;&#x6709;&#x6548;&#x6216;&#x6700;&#x9AD8;&#x6548;&#x7684;&#x5904;&#x7406;&#x65B9;&#x5F0F;&#x3002;&#x4F34;&#x968F;&#x7740;
                      IT
                      &#x4F53;&#x7CFB;&#x6846;&#x67B6;&#x7684;&#x6301;&#x7EED;&#x589E;&#x957F;&#x548C;&#x7AEF;&#x5BF9;&#x7AEF;&#x65F6;&#x5E8F;&#x6570;&#x636E;&#x7684;&#x957F;&#x671F;&#x7D2F;&#x79EF;&#xFF0C;&#x4E0D;&#x65AD;&#x5730;&#x589E;&#x52A0;&#x4E86;&#x5B9E;&#x73B0;&#x68B3;&#x7406;&#x4E1A;&#x52A1;&#x4EF7;&#x503C;&#x94FE;&#x7684;&#x96BE;&#x5EA6;&#x3002;&#x8FD9;&#x4E9B;&#x56E0;&#x7D20;&#x4E0E;&#x4F01;&#x4E1A;&#x7684;&#x6574;&#x4F53;&#x4E1A;&#x52A1;&#x6A21;&#x578B;&#x606F;&#x606F;&#x76F8;&#x5173;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x4EC0;&#x4E48;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x5C06;&#x6210;&#x4E3A;&#x4F01;&#x4E1A;&#x6218;&#x7565;&#x7EA7;&#x7684;&#x5173;&#x6CE8;&#x65B9;&#x5411;&#x3002;
                    </p>
                    <blockquote>
                      <p>
                        Long ago, all processes in an organization were manual,
                        and information went from one person, or department, to
                        another where individual people processed it. Today, all
                        that has changed. We can think of systems having
                        replaced the people who did the processing, and data
                        lineage having replaced the ways in which information
                        was sent between people and departments. An organization
                        must ask itself if the business value chain represented
                        by data lineage is the most effective and efficient way
                        to implement business processes that is possible. All
                        too often, organic growth in IT architecture and
                        point-to-point data transfers accumulate over time to
                        distort how business value chains are actually
                        implemented. This is where data lineage becomes a
                        strategic concern for enterprises, closely linked to
                        their overall business model.
                      </p>
                    </blockquote>
                    <p>
                      &#x4E8B;&#x5B9E;&#x6C42;&#x662F;&#x5730;&#x8BB2;&#xFF0C;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x7EC4;&#x7EC7;&#x5728;&#x4E1A;&#x52A1;&#x6218;&#x7565;&#x4E2D;&#x4F7F;&#x7528;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x8FD8;&#x6709;&#x5F88;&#x957F;&#x5730;&#x8DEF;&#x8981;&#x6478;&#x7D22;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x901A;&#x8FC7;&#x6280;&#x672F;&#x624B;&#x6BB5;&#x5B9E;&#x73B0;&#x7684;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x7528;&#x4F8B;&#x4F9D;&#x7136;&#x6709;&#x975E;&#x5E38;&#x5927;&#x7684;&#x4EF7;&#x503C;&#xFF08;&#x5373;&#x4F01;&#x4E1A;&#x8981;&#x5B9E;&#x73B0;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x7684;&#x6280;&#x672F;&#x95E8;&#x69DB;&#x8FD8;&#x6BD4;&#x8F83;&#x9AD8;&#xFF09;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x7EE7;&#x7EED;&#x7814;&#x7A76;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x4E1A;&#x52A1;&#x7528;&#x4F8B;&#xFF0C;&#x4EE5;&#x4FBF;&#x66F4;&#x6DF1;&#x5165;&#x5730;&#x7406;&#x89E3;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x662F;&#x4EC0;&#x4E48;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x4F53;&#x73B0;&#x5B83;&#x7684;&#x4E1A;&#x52A1;&#x4EF7;&#x503C;&#x3002;
                    </p>
                    <blockquote>
                      <p>
                        Truth be told, most organizations are still a long way
                        off from using data lineage in business strategy.
                        Nevertheless, the more technical use cases for data
                        lineage are still extremely valuable, and we will look
                        at a range of them now to gain a better appreciation of
                        what data lineage is and the value it provides.
                      </p>
                    </blockquote>
                    <h3
                      id="&#x7528;&#x4F8B;-1&#xFF1A;&#x6570;&#x636E;&#x62A5;&#x544A;&#x5B8C;&#x6574;&#x6027;&#x7684;&#x4FDD;&#x8BC1;"
                    >
                      &#x7528;&#x4F8B;
                      1&#xFF1A;&#x6570;&#x636E;&#x62A5;&#x544A;&#x5B8C;&#x6574;&#x6027;&#x7684;&#x4FDD;&#x8BC1;
                    </h3>
                    <blockquote>
                      <p>Use Case 1 Assurance of Data Integrity in Reports</p>
                    </blockquote>
                    <p>
                      &#x6570;&#x636E;&#x6CBF;&#x88AD;&#x9700;&#x6C42;&#x4EE4;&#x4EBA;&#x4FE1;&#x670D;&#x7684;&#x4E00;&#x4E2A;&#x8BBA;&#x70B9;&#x662F;&#x5B83;&#x53EF;&#x4EE5;&#x5FEB;&#x901F;&#x6253;&#x6D88;&#x7EC8;&#x7AEF;&#x7528;&#x6237;&#x5BF9;&#x62A5;&#x544A;&#x6570;&#x636E;&#x53EF;&#x9760;&#x6027;&#x7684;&#x6000;&#x7591;&#x3002;
                    </p>
                    <blockquote>
                      <p>
                        A compelling argument for the need for data lineage is
                        quickly resolving end-user doubts about the reliability
                        of the data they are seeing in their reports.
                      </p>
                    </blockquote>
                    <p>
                      &#x8BB8;&#x591A;&#x4E1A;&#x52A1; BI
                      &#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4EE5;&#x53CA;&#x62A5;&#x544A;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#xFF0C;&#x603B;&#x662F;&#x5904;&#x4E8E;&#x4E00;&#x79CD;&#x6050;&#x60E7;&#x4E0D;&#x5B89;&#x7684;&#x5FC3;&#x7406;&#x72B6;&#x6001;&#xFF0C;&#x62C5;&#x5FC3;&#x4E1A;&#x52A1;&#x7528;&#x6237;&#x8981;&#x6C42;&#x4ED6;&#x4EEC;&#x8BC1;&#x660E;&#x6570;&#x636E;&#x5206;&#x6790;&#x62A5;&#x544A;&#x4E2D;&#x7528;&#x6237;&#x770B;&#x5230;&#x7684;&#x90A3;&#x4E9B;&#x5947;&#x602A;&#x6570;&#x636E;&#x7684;&#x51C6;&#x786E;&#x6027;&#x3002;&#x63ED;&#x5F00;&#x8868;&#x8C61;&#x770B;&#x672C;&#x8D28;&#xFF0C;&#x6570;&#x636E;&#x5206;&#x6790;&#x62A5;&#x544A;&#x662F;&#x5426;&#x6709;&#x9519;&#x8BEF;&#x5E76;&#x975E;&#x91CD;&#x70B9;&#xFF0C;&#x800C;&#x662F;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x662F;&#x5426;&#x80FD;&#x591F;&#x5728;&#x5408;&#x7406;&#x7684;&#x65F6;&#x95F4;&#x5185;&#x7ED9;&#x4E1A;&#x52A1;&#x7528;&#x6237;&#x4E00;&#x4E2A;&#x4EE4;&#x4EBA;&#x4FE1;&#x670D;&#x7684;&#x89E3;&#x91CA;&#x2014;&#x2014;&#x5373;&#x4F7F;&#x62A5;&#x544A;&#x6570;&#x636E;&#x771F;&#x7684;&#x51FA;&#x73B0;&#x9519;&#x8BEF;&#x4E5F;&#x6CA1;&#x5173;&#x7CFB;&#x3002;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x65E0;&#x6CD5;&#x53CA;&#x65F6;&#x63D0;&#x4F9B;&#x51C6;&#x786E;&#x6027;&#x89E3;&#x91CA;&#xFF0C;&#x4E1A;&#x52A1;&#x7528;&#x6237;&#x81EA;&#x7136;&#x4F1A;&#x6000;&#x7591;&#x4ED6;&#x4EEC;&#x53EA;&#x770B;&#x5230;&#x4E86;&#x62A5;&#x544A;&#x4E2D;&#x9519;&#x8BEF;&#x6570;&#x636E;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x800C;&#x5DF2;&#xFF0C;&#x66F4;&#x6CA1;&#x6709;&#x7406;&#x7531;&#x76F8;&#x4FE1;&#x4ED6;&#x4EEC;&#x8F93;&#x51FA;&#x62A5;&#x544A;&#x65F6;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x7684;&#x6574;&#x5957;&#x62A5;&#x544A;&#x751F;&#x6210;&#x7CFB;&#x7EDF;&#x3002;
                    </p>
                    <blockquote>
                      <p>
                        Many BI developers, and report developers in the
                        business, live in constant terror of being asked by a
                        business user to confirm the accuracy of some strange
                        &#x201C;blip&#x201D; of data that the user is seeing in
                        a report. The most important thing to understand here is
                        that it is not whether there is an error in the report
                        or not that matters. What matters is whether the
                        developer can give the business user a convincing
                        explanation of what is going on within a reasonable time
                        or not &#x2013; even if it is an error. Failure to
                        deliver a timely explanation inevitably makes the
                        business user suspect that they are only seeing the tip
                        of the iceberg, and they have no reason to trust the
                        whole suite of reports they are working with.
                      </p>
                    </blockquote>
                    <p>
                      &#x901A;&#x8FC7;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#xFF0C;BI
                      &#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x53EF;&#x4EE5;&#x8FFD;&#x6EAF;&#x5F02;&#x5E38;&#x6570;&#x636E;&#x5143;&#x7D20;&#x7684;&#x6CBF;&#x88AD;&#xFF0C;&#x5E76;&#x68C0;&#x67E5;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x94FE;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#xFF0C;&#x4EE5;&#x786E;&#x8BA4;&#x53D1;&#x505A;&#x4E86;&#x4EC0;&#x4E48;&#x6570;&#x636E;&#x5904;&#x7406;&#x3002;&#x4ECE;&#x800C;&#x5B9E;&#x73B0;&#x89E3;&#x91CA;&#x5F02;&#x5E38;&#x6570;&#x636E;&#x7684;&#x76EE;&#x7684;&#x2014;&#x2014;&#x65E0;&#x8BBA;&#x5BF9;&#x4E0E;&#x9519;&#x3002;
                    </p>
                    <blockquote>
                      <p>
                        With data lineage, a BI developer can trace back the
                        lineage of the offending data element and inspect each
                        node in the data lineage chain to determine what is
                        happening. Clarity of the situation &#x2013; whether
                        good or bad &#x2013; is achieved.
                      </p>
                    </blockquote>
                    <p>
                      &#x4E0A;&#x8FF0;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x7528;&#x4F8B;&#x5173;&#x6CE8;&#x66F4;&#x591A;&#x7684;&#x662F;&#x6280;&#x672F;&#x65B9;&#x9762;&#xFF0C;&#x7136;&#x800C;&#xFF0C;&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x65E5;&#x5E38;&#x6240;&#x7ECF;&#x5386;&#x7684;&#x6570;&#x636E;&#x95EE;&#x9898;&#xFF0C;&#x6570;&#x636E;&#x6CBF;&#x7EE7;&#x6709;&#x7740;&#x66F4;&#x5E7F;&#x6CDB;&#x7684;&#x5E94;&#x7528;&#x3002;
                    </p>
                    <blockquote>
                      <p>
                        Our first couple of use cases have focused on more
                        technical aspects. However, data lineage has a wider
                        application, as we will now see.
                      </p>
                    </blockquote>
                    <h3
                      id="&#x7528;&#x4F8B;-2&#xFF1A;&#x5F71;&#x54CD;&#x5206;&#x6790;"
                    >
                      &#x7528;&#x4F8B; 2&#xFF1A;&#x5F71;&#x54CD;&#x5206;&#x6790;
                    </h3>
                    <blockquote>
                      <p>Use Case 2 Impact Analysis</p>
                    </blockquote>
                    <p>
                      &#x7EC4;&#x7EC7;&#x4E2D;&#x7ECF;&#x5E38;&#x6709;&#x53D8;&#x66F4;&#x6570;&#x636E;&#x5BF9;&#x8C61;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x4F46;&#x4EE4;&#x4EBA;&#x5934;&#x75DB;&#x7684;&#x662F;&#x96BE;&#x4EE5;&#x786E;&#x8BA4;&#x6570;&#x636E;&#x53D8;&#x66F4;&#x7684;&#x5F71;&#x54CD;&#x8303;&#x56F4;&#x3002;&#x901A;&#x5E38;&#x89E3;&#x51B3;&#x8FD9;&#x7C7B;&#x95EE;&#x9898;&#x7684;&#x65B9;&#x5F0F;&#x662F;&#x901A;&#x8FC7;&#x63CF;&#x8FF0;&#x6570;&#x636E;&#x53D8;&#x66F4;&#x7EC6;&#x8282;&#xFF0C;&#x5E76;&#x5E7F;&#x6CDB;&#x5730;&#x8BE2;&#x95EE;&#x540C;&#x4E8B;&#x4ED6;&#x4EEC;&#x6240;&#x7528;&#x7684;&#x7CFB;&#x7EDF;&#x662F;&#x5426;&#x4F1A;&#x53D7;&#x5230;&#x672C;&#x6B21;&#x6570;&#x636E;&#x53D8;&#x66F4;&#x7684;&#x5F71;&#x54CD;&#x3002;&#x786E;&#x5207;&#x5730;&#x8BB2;&#xFF0C;&#x8FD9;&#x4E9B;&#x540C;&#x4E8B;&#x4E5F;&#x5F88;&#x96BE;&#x77E5;&#x9053;&#x4ED6;&#x4EEC;&#x7684;&#x7CFB;&#x7EDF;&#x662F;&#x5426;&#x53D7;&#x5230;&#x5F71;&#x54CD;&#x3002;&#x4E0D;&#x65AD;&#x5730;&#x8BE2;&#x95EE;&#x6240;&#x6709;&#x90E8;&#x95E8;&#x7684;&#x540C;&#x4E8B;&#x662F;&#x5426;&#x4F1A;&#x53D7;&#x5230;&#x5F71;&#x54CD;&#xFF0C;&#x800C;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x636E;&#x60C5;&#x51B5;&#x90FD;&#x4E0D;&#x4F1A;&#x53D7;&#x5230;&#x5F71;&#x54CD;&#xFF0C;&#x8FD9;&#x79CD;&#x8DE8;&#x90E8;&#x95E8;&#x786E;&#x8BA4;&#x6570;&#x636E;&#x53D8;&#x66F4;&#x5F71;&#x54CD;&#x8303;&#x56F4;&#x7684;&#x65B9;&#x5F0F;&#x884D;&#x751F;&#x51FA;&#x7EC4;&#x7EC7;&#x6DF7;&#x4E71;&#x7684;&#x98CE;&#x9669;&#xFF0C;&#x4ECE;&#x800C;&#x5BFC;&#x81F4;&#x5927;&#x5BB6;&#x5BF9;&#x7BA1;&#x7406;&#x6570;&#x636E;&#x53D8;&#x66F4;&#x7684;&#x90E8;&#x95E8;&#x6028;&#x58F0;&#x8F7D;&#x9053;&#x3002;&#x7BA1;&#x7406;&#x6570;&#x636E;&#x53D8;&#x66F4;&#x7684;&#x56E2;&#x961F;&#x5E38;&#x5E38;&#x6577;&#x884D;&#x4E86;&#x4E8B;&#xFF0C;&#x9ED8;&#x9ED8;&#x5730;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x53D8;&#x66F4;&#xFF0C;&#x7136;&#x540E;&#x5FD0;&#x5FD1;&#x5730;&#x9759;&#x89C2;&#x5176;&#x4ED6;&#x90E8;&#x95E8;&#x662F;&#x5426;&#x4F1A;&#x53D7;&#x672C;&#x6B21;&#x6570;&#x636E;&#x53D8;&#x66F4;&#x800C;&#x66B4;&#x96F7;&#x3002;
                    </p>
                    <blockquote>
                      <p>
                        Changes involving data objects are frequent in an
                        organization. A major headache is the determination of
                        who may be affected if the change is implemented. One
                        way of approaching this is to describe the change and
                        ask a wide range of staff if they think that something
                        in their area may be affected. Exactly which staff
                        should be asked is difficult to know, because the impact
                        is not known. Continuously asking a very broad range of
                        individuals in an organization if they might be
                        affected, when most of them inevitably will not, risks
                        disruption that will lead to complaints about those
                        managing the proposed change. All too often a team
                        managing a change only makes a perfunctory effort to
                        assess impact, and simply makes the change and waits to
                        see if anyone will complain right away.
                      </p>
                    </blockquote>
                    <p>
                      &#x6570;&#x636E;&#x6CBF;&#x88AD;&#x5728;&#x5206;&#x6790;&#x6570;&#x636E;&#x53D8;&#x66F4;&#x7684;&#x5F71;&#x54CD;&#x8303;&#x56F4;&#x65F6;&#x5177;&#x6709;&#x5DE8;&#x5927;&#x7684;&#x4F18;&#x52BF;&#x3002;&#x901A;&#x8FC7;&#x5206;&#x6790;&#x4E0E;&#x8BE5;&#x53D8;&#x66F4;&#x6570;&#x636E;&#x6709;&#x4EA4;&#x4E92;&#x7684;&#x4E1A;&#x52A1;&#x7528;&#x6237;&#x884C;&#x4E3A;&#xFF0C;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x53EF;&#x4EE5;&#x786E;&#x8BA4;&#x6570;&#x636E;&#x53D8;&#x66F4;&#x5F71;&#x54CD;&#x7684;&#x4E0B;&#x6E38;&#x6570;&#x636E;&#x5BF9;&#x8C61;&#x3002;&#x8FD9;&#x4E00;&#x70B9;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x5E76;&#x975E;&#x6240;&#x6709;&#x6570;&#x636E;&#x5F71;&#x54CD;&#x53EA;&#x6D89;&#x53CA;&#x6280;&#x672F;&#x7CFB;&#x7EDF;&#x6216;&#x6570;&#x636E;&#x672C;&#x8EAB;&#xFF0C;&#x4E5F;&#x6709;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x4E1A;&#x52A1;&#x6D41;&#x7A0B;&#x76F8;&#x5E94;&#x7684;&#x9002;&#x914D;&#x66F4;&#x6539;&#x3002;
                    </p>
                    <blockquote>
                      <p>
                        Data lineage is a huge advantage in impact analysis. The
                        data objects downstream of where the change will be
                        implemented are identified, along with the business
                        users who interact with them. This is important because
                        not every impact is a technical system or data impact,
                        and business process changes may be required.
                      </p>
                    </blockquote>
                    <h3
                      id="&#x7528;&#x4F8B;-3&#xFF1A;&#x8FFD;&#x8E2A;&#x4E2A;&#x4EBA;&#x4FE1;&#x606F;pi"
                    >
                      &#x7528;&#x4F8B;
                      3&#xFF1A;&#x8FFD;&#x8E2A;&#x4E2A;&#x4EBA;&#x4FE1;&#x606F;(PI)
                    </h3>
                    <blockquote>
                      <p>Use Case 3 Tracking Personal Information (PI)</p>
                    </blockquote>
                    <p>
                      &#x6570;&#x636E;&#x9690;&#x79C1;&#x4E8B;&#x4EF6;&#x6570;&#x91CF;&#x5728;&#x8FC7;&#x53BB;&#x51E0;&#x5E74;&#x4E2D;&#x5448;&#x7206;&#x70B8;&#x5F0F;&#x589E;&#x957F;&#xFF0C;&#x4EBA;&#x4EEC;&#x666E;&#x904D;&#x62C5;&#x5FC3;&#x4E2A;&#x4EBA;&#x4FE1;&#x606F;(PI)&#x4F1A;&#x88AB;&#x653F;&#x5E9C;&#x3001;&#x516C;&#x53F8;&#x548C;&#x72AF;&#x7F6A;&#x5206;&#x5B50;&#x7A83;&#x53D6;&#x6EE5;&#x7528;&#x3002;&#x5728;&#x67D0;&#x4E9B;&#x53F8;&#x6CD5;&#x7BA1;&#x8F96;&#x533A;&#x5DF2;&#x7ECF;&#x9881;&#x5E03;&#x4E86;&#x65B0;&#x7684;&#x76F8;&#x5173;&#x6CD5;&#x5F8B;&#xFF0C;&#x6B27;&#x76DF;&#x7684;
                      GDPR &#x660E;&#x786E;&#x8981;&#x6C42;&#x8BF4;&#x660E; PI
                      &#x5728;&#x6570;&#x636E;&#x9886;&#x57DF;&#x7528;&#x5904;&#x8BF4;&#x660E;&#x3002;
                    </p>
                    <blockquote>
                      <p>
                        Data Privacy has exploded in the past few years, with
                        widespread concerns about the misuse of personal
                        information (PI) by governments, corporations, and
                        criminals. New laws have been enacted in several
                        jurisdictions, and the European Union&#x2019;s GDPR
                        explicitly calls out the need to know where PI is
                        located in the data landscape.
                      </p>
                    </blockquote>
                    <p>
                      &#x6570;&#x636E;&#x5206;&#x6790;&#x662F;&#x786E;&#x8BA4;
                      PI
                      &#x7528;&#x9014;&#x7684;&#x4F20;&#x7EDF;&#x65B9;&#x5F0F;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x9700;&#x8981;&#x68C0;&#x67E5;&#x6BCF;&#x4E2A;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x8868;&#xFF08;&#x6216;&#x5176;&#x4ED6;&#x975E;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5BF9;&#x8C61;&#xFF09;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x5217;&#x6570;&#x636E;&#xFF0C;&#x4ECE;&#x800C;&#x63A8;&#x65AD;&#x5B83;&#x662F;&#x5426;&#x662F;
                      PI&#x3002;&#x7136;&#x800C;&#xFF0C;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x66F4;&#x597D;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x5982;&#x679C;&#x6240;&#x6709;&#x7684;&#x6570;&#x636E;&#x6D41;&#x90FD;&#x662F;&#x5DF2;&#x77E5;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x6570;&#x636E;&#x6D41;&#x8DEF;&#x5F84;&#x4E2D;&#x4EFB;&#x610F;&#x8282;&#x70B9;&#x4E0A;&#x7684;&#x4E00;&#x5217;&#x90FD;&#x53EF;&#x4EE5;&#x6807;&#x8BC6;&#x4E3A;
                      PI&#xFF0C;&#x90A3;&#x4E48;&#x8BE5;&#x8DEF;&#x5F84;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x5728;&#x903B;&#x8F91;&#x4E0A;&#x5C5E;&#x4E8E;&#x540C;&#x4E00;&#x4EFD;
                      PI&#x3002;&#x8FD9;&#x4F7F;&#x5F97;&#x5206;&#x6790;&#x4EBA;&#x5458;&#x53EF;&#x4EE5;&#x7075;&#x6D3B;&#x3001;&#x5FEB;&#x901F;&#x5730;&#x8BC6;&#x522B;
                      PI&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x4EFB;&#x4F55;&#x7279;&#x5B9A;&#x7684;&#x8DEF;&#x5F84;&#x4E2D;&#xFF0C;&#x8FD9;&#x79CD;&#x5904;&#x7406;&#x53EA;&#x9700;&#x8981;&#x505A;&#x4E00;&#x6B21;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x4E0E;&#x4F20;&#x7EDF;&#x7684;&#x6570;&#x636E;&#x5206;&#x6790;&#x4E0D;&#x540C;&#x7684;&#x662F;&#xFF0C;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x53EF;&#x4EE5;&#x6269;&#x5C55;&#x5230;&#x6570;&#x636E;&#x62A5;&#x544A;&#x5C42;&#x548C;&#x6570;&#x636E;&#x5E93;&#x5C42;&#x3002;
                    </p>
                    <blockquote>
                      <p>
                        The traditional approach to the need to know where PI is
                        located has been data profiling. This involves examining
                        each column in each relational database table (or other
                        non-relational data objects) to try to infer if it is PI
                        or not. However, data lineage provides a better
                        solution. If all the data flows are known, then if a
                        column at any node in a data flow pathway can be
                        identified as PI, then every node in that pathway is
                        logically the same piece of PI. This makes it scalable
                        to have analysts identify PI, since this only has to be
                        done once in any particular pathway. Furthermore, data
                        lineage extends into reporting layers as well as
                        databases, unlike traditional data profiling.
                      </p>
                    </blockquote>
                    <p>
                      &#x8FD9;&#x610F;&#x5473;&#x7740;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;&#x62A5;&#x8868;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x5143;&#x7D20;&#x6807;&#x8BC6;&#x4E3A;
                      PI&#xFF08;&#x62A5;&#x8868;&#x7528;&#x6237;&#x5E94;&#x8BE5;&#x5F88;&#x5BB9;&#x6613;&#x505A;&#x5230;&#x8FD9;&#x4E00;&#x70B9;&#xFF09;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x6D89;&#x53CA;&#x8BE5;&#x6570;&#x636E;&#x5143;&#x7D20;&#x7684;&#x6240;&#x6709;&#x6CBF;&#x88AD;&#x8DEF;&#x5F84;&#x4E2D;&#x627E;&#x5230;
                      PI
                      &#x5217;&#x3002;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x597D;&#x5904;&#x662F;&#xFF0C;&#x77E5;&#x9053;&#x54EA;&#x4E9B;&#x62A5;&#x544A;&#x5305;&#x542B;
                      PI
                      &#x53EF;&#x4EE5;&#x66F4;&#x5BB9;&#x6613;&#x5730;&#x7BA1;&#x7406;&#x5B83;&#x4EEC;&#x7684;&#x4F20;&#x64AD;&#x8303;&#x56F4;&#x2014;&#x2014;&#x65E0;&#x8BBA;&#x5728;&#x4F01;&#x4E1A;&#x5185;&#x90E8;&#x8FD8;&#x662F;&#x5916;&#x90E8;&#x3002;
                    </p>
                    <blockquote>
                      <p>
                        This means that if we can identify a data element in a
                        report as PI, which a report user should be easily able
                        to do, then we can find PI columns across all the
                        lineage pathways involving this data element. An added
                        bonus is that knowing what reports contain PI makes it
                        easier to govern their dissemination &#x2013; both
                        inside and outside the enterprise.
                      </p>
                    </blockquote>
                    <p>
                      &#x4ECE; PI
                      &#x5206;&#x6790;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x4F7F;&#x7528;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x5DE5;&#x5177;&#x63A7;&#x5236;&#x6570;&#x636E;&#x73AF;&#x5883;&#x662F;&#x6570;&#x636E;&#x6CBB;&#x7406;&#x4EE5;&#x53CA;&#x7EC4;&#x7EC7;&#x9075;&#x5B88;&#x4EFB;&#x4F55;&#x6CD5;&#x5F8B;&#x6216;&#x9690;&#x79C1;&#x529F;&#x80FD;&#x6240;&#x5173;&#x6CE8;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x8BF4;&#x660E;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x5728;
                      IT
                      &#x8303;&#x7574;&#x4E4B;&#x5916;&#x4E5F;&#x975E;&#x5E38;&#x6709;&#x4EF7;&#x503C;&#x3002;
                    </p>
                    <blockquote>
                      <p>
                        Using a data lineage tool to bring a data environment
                        under control from the perspective of PI is a concern of
                        Data Governance and any Legal or Privacy function in an
                        organization. This demonstrates how valuable data
                        lineage can be outside of IT.
                      </p>
                    </blockquote>
                    <h3
                      id="&#x7528;&#x4F8B;-4&#xFF1A;&#x88AB;&#x4E2D;&#x65AD;&#x7684;-etl"
                    >
                      &#x7528;&#x4F8B; 4&#xFF1A;&#x88AB;&#x4E2D;&#x65AD;&#x7684;
                      ETL
                    </h3>
                    <blockquote>
                      <p>Use Case 4 Broken ETL</p>
                    </blockquote>
                    <p>
                      &#x8BE5;&#x7528;&#x4F8B;&#x901A;&#x5E38;&#x662F;&#x7F3A;&#x5C11;&#x4E0A;&#x8FF0;&#x6240;&#x8BA8;&#x8BBA;&#x7684;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x80FD;&#x529B;&#x800C;&#x5BFC;&#x81F4;&#x7684;&#x975E;&#x9884;&#x671F;&#x7ED3;&#x679C;&#x3002;ETL&#xFF08;&#x63D0;&#x53D6;-&#x8F6C;&#x6362;-&#x52A0;&#x8F7D;&#xFF09;&#x4EFB;&#x52A1;&#x5728;&#x7EC4;&#x7EC7;&#x4E2D;&#x8FC1;&#x79FB;&#x6570;&#x636E;&#x65F6;&#x6839;&#x636E;&#x4E1A;&#x52A1;&#x9700;&#x6C42;&#x5BF9;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x91CD;&#x6784;&#x3001;&#x4E30;&#x5BCC;&#x548C;&#x96C6;&#x6210;&#x3002;&#x4E0E;&#x4E4B;&#x5BC6;&#x5207;&#x76F8;&#x5173;&#x7684;&#x662F;
                      ELT&#xFF08;&#x63D0;&#x53D6;-&#x52A0;&#x8F7D;-&#x8F6C;&#x6362;&#xFF09;&#x4EFB;&#x52A1;&#x3002;&#x5728;
                      ELT
                      &#x4EFB;&#x52A1;&#x4E2D;&#xFF0C;&#x4ECE;&#x6570;&#x636E;&#x6E90;&#x83B7;&#x53D6;&#x5230;&#x6570;&#x636E;&#x5E76;&#x52A0;&#x8F7D;&#x5230;&#x76EE;&#x6807;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x8FDB;&#x884C;&#x8F6C;&#x6362;&#x5904;&#x7406;&#x3002;&#x5BF9;&#x4E8E;
                      ETL
                      &#x4EFB;&#x52A1;&#xFF0C;&#x6709;&#x4E00;&#x79CD;&#x66F4;&#x4F20;&#x7EDF;&#x7684;&#x5904;&#x7406;&#x65B9;&#x6CD5;&#x662F;&#x5728;&#x52A0;&#x8F7D;&#x6570;&#x636E;&#x4E4B;&#x524D;&#x8FDB;&#x884C;&#x8F6C;&#x6362;&#x5904;&#x7406;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x4F7F;&#x7528;
                      &#x201C;ETL&#x201D;
                      &#x6982;&#x5FF5;&#x6765;&#x6DB5;&#x76D6;&#x8FD9;&#x4E24;&#x79CD;&#x6570;&#x636E;&#x5904;&#x7406;&#x65B9;&#x6CD5;&#x3002;
                    </p>
                    <blockquote>
                      <p>
                        This use case is often a consequence of the lack of
                        implementation of the use case we have just discussed.
                        Extract-Transform-and-Load (ETL) tasks move data around
                        the organization, often reshaping, enriching, and
                        integrating the data as they do so. Closely related is
                        ELT (Extract- Load-and-Transform). In ELT, data is taken
                        from a source, loaded into target database, and then
                        transformed. With ETL, there is a more traditional
                        approach of doing the transformation before loading the
                        data. We shall use &#x201C;ETL&#x201D; to cover both
                        approaches.
                      </p>
                    </blockquote>
                    <p>
                      ETL
                      &#x4F5C;&#x4E1A;&#x5728;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x6267;&#x884C;&#x65F6;&#x53EF;&#x80FD;&#x4F1A;&#x53D1;&#x751F;&#x4E2D;&#x65AD;&#xFF0C;&#x8FD9;&#x901A;&#x5E38;&#x662F;&#x7531;&#x4E8E;&#x4E0A;&#x6E38;&#x6570;&#x636E;&#x53D8;&#x66F4;&#x800C;&#x672A;&#x4E0E;&#x76F8;&#x5173;&#x90E8;&#x95E8;&#x6C9F;&#x901A;&#x9020;&#x6210;&#x7684;&#x3002;&#x4E00;&#x65E6;&#x53D1;&#x751F;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;IT
                      &#x90E8;&#x95E8;&#x5C31;&#x8981;&#x6297;&#x7740;&#x88AB;&#x67AA;&#x9876;&#x7740;&#x7684;&#x538B;&#x529B;&#x627E;&#x51FA;
                      ETL
                      &#x4F5C;&#x4E1A;&#x4E2D;&#x65AD;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x5E76;&#x52A0;&#x4EE5;&#x89E3;&#x51B3;&#x3002;
                    </p>
                    <blockquote>
                      <p>
                        ETL jobs sometimes break in production, often as the
                        result of some upstream change that was not
                        communicated. Once this happens IT is under the gun to
                        figure out what happened and fix it.
                      </p>
                    </blockquote>
                    <p>
                      &#x7531;&#x4E8E;&#x4E0A;&#x6E38;&#x7684;&#x6570;&#x636E;&#x53D8;&#x66F4;&#x7ECF;&#x5E38;&#x4F1A;&#x5F71;&#x54CD;&#x4E0B;&#x6E38;&#x7684;
                      ETL
                      &#x4EFB;&#x52A1;&#xFF0C;&#x56E0;&#x6B64;&#x9700;&#x8981;&#x7ACB;&#x5373;&#x9A8C;&#x8BC1;&#x662F;&#x5426;&#x5982;&#x6B64;&#x3002;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x5141;&#x8BB8;
                      IT &#x4EBA;&#x5458;&#x56DE;&#x6EAF; ETL
                      &#x4F5C;&#x4E1A;&#x7684;&#x6570;&#x636E;&#x4F9D;&#x8D56;&#x8DEF;&#x5F84;&#x3002;&#x6709;&#x4E86;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5F88;&#x8F7B;&#x677E;&#x5730;&#x5206;&#x6790;&#x5E76;&#x53D1;&#x73B0;&#x8FD9;&#x6761;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x8DEF;&#x5F84;&#x4E0A;&#x53D1;&#x751F;&#x4E86;&#x4EC0;&#x4E48;&#x53D8;&#x66F4;&#xFF0C;&#x5E76;&#x8FDB;&#x884C;&#x9002;&#x914D;&#x517C;&#x5BB9;&#x4FEE;&#x590D;&#x3002;
                    </p>
                    <blockquote>
                      <p>
                        Since it is so often the case that an upstream change
                        has broken the ETL, this hypothesis needs to be tested
                        right away. Data lineage allows IT staff to trace back
                        the pathway to the ETL job. With this, it is a
                        comparatively simple job to investigate what if anything
                        has changed in this pathway and fix it.
                      </p>
                    </blockquote>
                    <p>
                      &#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x5177;&#x5907;&#x67E5;&#x660E;&#x5230;&#x5E95;&#x662F;&#x54EA;&#x91CC;&#x51FA;&#x4E86;&#x95EE;&#x9898;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x53EF;&#x4EE5;&#x68C0;&#x6D4B;&#x548C;&#x5206;&#x6790;&#x6570;&#x636E;&#x95EE;&#x9898;&#x7684;&#x6839;&#x672C;&#x539F;&#x56E0;&#x3002;&#x6B64;&#x65F6;&#xFF0C;&#x7531;&#x4E8E;&#x4E0A;&#x6E38;&#x6570;&#x636E;&#x53D8;&#x66F4;&#x5F71;&#x54CD;&#x4E0B;&#x6E38;
                      ETL
                      &#x4EFB;&#x52A1;&#x7684;&#x95EE;&#x9898;&#x5E76;&#x6CA1;&#x6709;&#x5F97;&#x5230;&#x672C;&#x8D28;&#x89E3;&#x51B3;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x4FEE;&#x590D;
                      ETL
                      &#x4EFB;&#x52A1;&#x65F6;&#xFF0C;&#x4E5F;&#x6709;&#x53EF;&#x80FD;&#x53D1;&#x751F;&#x6570;&#x636E;&#x53D8;&#x66F4;&#xFF0C;&#x4ECE;&#x800C;&#x8FDB;&#x4E00;&#x6B65;&#x5F71;&#x54CD;&#x4E86;&#x6574;&#x4E2A;&#x6570;&#x636E;&#x4F53;&#x7CFB;&#x3002;&#x56E0;&#x6B64;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x5728;&#x6839;&#x672C;&#x539F;&#x56E0;&#x5206;&#x6790;&#x548C;&#x9519;&#x8BEF;&#x4FEE;&#x590D;&#x4E2D;&#x53D1;&#x6325;&#x7684;&#x4F5C;&#x7528;&#x4E0D;&#x80FD;&#x8FC7;&#x5EA6;&#x5938;&#x5927;&#x3002;
                    </p>
                    <blockquote>
                      <p>
                        Most importantly, data lineage can pinpoint what is
                        broken. This means that the root cause of the problem
                        can be detected and analyzed. All too often, this is not
                        done, and downstream workarounds are implemented that
                        further distort the overall architecture. The role of
                        data lineage in root cause analysis and error correction
                        cannot be overstated.
                      </p>
                    </blockquote>
                    <h3
                      id="&#x7528;&#x4F8B;-5&#xFF1A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x548C;&#x62A5;&#x544A;&#x8FC1;&#x79FB;"
                    >
                      &#x7528;&#x4F8B;
                      5&#xFF1A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x548C;&#x62A5;&#x544A;&#x8FC1;&#x79FB;
                    </h3>
                    <blockquote>
                      <p>Use Case 5 Migration of Applications and Reports</p>
                    </blockquote>
                    <p>
                      &#x7531;&#x4E8E;&#x5404;&#x79CD;&#x539F;&#x56E0;&#x9700;&#x8981;&#x8FC1;&#x79FB;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x548C;&#x62A5;&#x544A;&#x6570;&#x636E;&#xFF0C;&#x671F;&#x95F4;&#x53EF;&#x80FD;&#x4F1A;&#x8017;&#x5C3D;&#x786C;&#x4EF6;&#x6216;&#x8F6F;&#x4EF6;&#x8D44;&#x6E90;&#x3002;&#x65B0;&#x53D1;&#x5E03;&#x7684;&#x8F6F;&#x4EF6;&#x4EA7;&#x54C1;&#x901A;&#x5E38;&#x5177;&#x6709;&#x975E;&#x5E38;&#x5438;&#x5F15;&#x4EBA;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x8FD0;&#x884C;&#x4F7F;&#x7528;&#x7684;&#x9891;&#x7387;&#x5F88;&#x9AD8;&#x4E5F;&#x4F1A;&#x5BFC;&#x81F4;&#x8F6F;&#x4EF6;&#x5D29;&#x6E83;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x73B0;&#x5728;&#x5DF2;&#x7ECF;&#x4ECE;&#x5185;&#x90E8;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x53D1;&#x5C55;&#x5230;&#x4E86;&#x4E91;&#x5E73;&#x53F0;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x5C06;&#x8981;&#x5173;&#x6CE8;&#x7684;&#x6570;&#x636E;&#x8FC1;&#x79FB;&#x573A;&#x666F;&#x3002;
                    </p>
                    <blockquote>
                      <p>
                        Migration of applications and reports is needed for many
                        reasons. Support can run out for hardware or software. A
                        new software product can become available with very
                        attractive features. This is often the case with
                        reporting software which seems to turn over on a very
                        frequent basis. Today, however, there is a generational
                        shift away from on-premise data centers to the Cloud,
                        and this is the example of migration we will focus on.
                      </p>
                    </blockquote>
                    <p>
                      &#x5F53;&#x4ECE;&#x672C;&#x5730;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x8FC1;&#x79FB;
                      IT
                      &#x670D;&#x52A1;&#x81F3;&#x4E91;&#x5E73;&#x53F0;&#x65F6;&#xFF0C;&#x4E0D;&#x4EC5;&#x4EC5;&#x9700;&#x8981;&#x5728;&#x4E91;&#x5E73;&#x53F0;&#x4E2D;&#x590D;&#x5236;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3001;&#x5904;&#x7406;&#x903B;&#x8F91;&#x548C;&#x62A5;&#x544A;&#x4F53;&#x7CFB;&#xFF0C;&#x6570;&#x636E;&#x6D41;&#x4E5F;&#x9700;&#x8981;&#x88AB;&#x590D;&#x5236;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x9700;&#x8981;&#x7406;&#x89E3;&#x5F53;&#x524D;&#x5DF2;&#x5B58;&#x5728;&#x7684;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x60C5;&#x51B5;&#x3002;
                    </p>
                    <blockquote>
                      <p>
                        When a migration away from on- premise occurs, there is
                        not simply a need to replicate the data structures,
                        processing logic, and reports in the Cloud. The flow of
                        data also has to be replicated. This means understanding
                        the existing data lineage.
                      </p>
                    </blockquote>
                    <p>
                      &#x8FC1;&#x79FB;&#x65F6;&#x7ECF;&#x5E38;&#x91C7;&#x7528;
                      &#x201C;Left and
                      Shift&#x201D;&#xFF08;&#x5E94;&#x7528;&#x4E0E;&#x6570;&#x636E;&#x4E00;&#x540C;&#x8FC1;&#x79FB;&#x81F3;&#x4E91;&#x5E73;&#x53F0;&#xFF09;
                      &#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x9057;&#x7559;&#x73AF;&#x5883;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x95EE;&#x9898;&#xFF0C;&#x540C;&#x6837;&#x4F1A;&#x51FA;&#x73B0;&#x5728;&#x4E91;&#x5E73;&#x53F0;&#x3002;&#x8FD9;&#x79CD;&#x8FC1;&#x79FB;&#x65B9;&#x5F0F;&#x5BF9;&#x4E8E;&#x5E0C;&#x671B;&#x964D;&#x4F4E;&#x98CE;&#x9669;&#x5E76;&#x6309;&#x65F6;&#x4EA4;&#x4ED8;&#x9879;&#x76EE;&#x7684;&#x9879;&#x76EE;&#x7ECF;&#x7406;&#x548C;&#x53D1;&#x8D77;&#x4EBA;&#x6765;&#x8BF4;&#x662F;&#x975E;&#x5E38;&#x6709;&#x5438;&#x5F15;&#x529B;&#x7684;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x8FD9;&#x5BF9;&#x6210;&#x719F;&#x4F01;&#x4E1A;&#x7684;&#x957F;&#x671F;&#x751F;&#x5B58;&#x80FD;&#x529B;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x4E25;&#x91CD;&#x7684;&#x6F5C;&#x5728;&#x98CE;&#x9669;&#xFF0C;&#x4F01;&#x4E1A;&#x4E2D;&#x5DF2;&#x7ECF;&#x5B58;&#x5728;&#x4E86;&#x51E0;&#x5341;&#x5E74;&#x90FD;&#x4F7F;&#x7528;
                      &#x201C;Left and Shift&quot;
                      &#x65B9;&#x5F0F;&#x8FC1;&#x79FB;&#x7684;&#x6570;&#x636E;&#x957F;&#x94FE;&#xFF0C;&#x6BCF;&#x6B21;&#x8FC1;&#x79FB;&#x65F6;&#x90FD;&#x4F1A;&#x7D2F;&#x52A0;&#x4E00;&#x4E2A;&#x53C8;&#x4E00;&#x4E2A;&#x7279;&#x6027;&#x53CA;&#x4E00;&#x4E2A;&#x53C8;&#x4E00;&#x4E2A;&#x7279;&#x6027;&#x517C;&#x5BB9;&#x65B9;&#x6848;&#x3002;
                    </p>
                    <blockquote>
                      <p>
                        There is an overwhelming temptation to adopt a
                        &#x201C;lift and shift&#x201D; approach to migration,
                        meaning that the legacy environment, with all its
                        blemishes, is replicated as closely as possible in the
                        Cloud environment. This is incredibly appealing to
                        project managers and sponsors who want to drive down
                        risk and deliver the project on time. Yet it is a very
                        grave risk to the long-term viability of the mature
                        enterprises that take this approach. A long chain of
                        periodic migrations in an enterprise that has been
                        around for decades heap idiosyncrasy upon idiosyncrasy
                        and workaround upon workaround with each migration.
                      </p>
                    </blockquote>
                    <p>
                      &#x91CD;&#x70B9;&#x662F;&#xFF0C;&#x6210;&#x719F;&#x4F01;&#x4E1A;&#x5728;&#x8FC1;&#x79FB;&#x8FC7;&#x7A0B;&#x4E2D;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x65B9;&#x6848;&#x6765;&#x68B3;&#x7406;&#x4ED6;&#x4EEC;&#x7684;&#x4E1A;&#x52A1;&#x6D41;&#x7A0B;&#x5E76;&#x8FDB;&#x884C;&#x5408;&#x7406;&#x91CD;&#x6784;&#x3002;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x6570;&#x636E;&#x6D41;&#x7684;&#x7B80;&#x5355;&#x6620;&#x5C04;&#x2014;&#x2014;&#x5B83;&#x66F4;&#x662F;&#x4F53;&#x73B0;&#x4E86;&#x5BF9;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x4E1A;&#x52A1;&#x6D41;&#x7A0B;&#x7684;&#x7406;&#x89E3;&#x3002;&#x7406;&#x60F3;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6210;&#x719F;&#x4F01;&#x4E1A;&#x5E94;&#x8BE5;&#x901A;&#x8FC7;&#x6570;&#x636E;&#x6CBB;&#x88AD;&#x62BD;&#x8C61;&#x5E76;&#x63D0;&#x70BC;&#x8FD9;&#x4E9B;&#x4E1A;&#x52A1;&#x6D41;&#x7A0B;&#xFF0C;&#x7136;&#x540E;&#x91CD;&#x65B0;&#x8BBE;&#x8BA1;&#x5B83;&#x4EEC;&#x3002;
                    </p>
                    <blockquote>
                      <p>
                        The point here is that mature enterprises should use
                        data lineage during a migration to understand their
                        business processes and re- engineer them. Data lineage
                        is not just a map of how data flows &#x2013; it reveals
                        an understanding of how the ultimate business processes
                        have been implemented. Ideally, a mature enterprise will
                        abstract back from the data lineage to what these
                        processes should be today and redesign them.
                      </p>
                    </blockquote>
                    <p>
                      &#x5982;&#x4E0A;&#x6240;&#x8A00;&#xFF0C;&#x8FC1;&#x79FB;&#x4F7F;&#x7528;&#x91C7;&#x7528;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x7684;&#x65B9;&#x5F0F;&#x8FD8;&#x5177;&#x6709;&#x901F;&#x5EA6;&#x4E0A;&#x7684;&#x4F18;&#x52BF;&#x3002;&#x7279;&#x522B;&#x662F;&#x5728;&#x8BC6;&#x522B;&#x6570;&#x636E;&#x548C;&#x62A5;&#x544A;&#x5BF9;&#x8C61;&#x65F6;&#xFF0C;&#x80FD;&#x7504;&#x522B;&#x51FA;&#x54EA;&#x4E9B;&#x6570;&#x636E;&#x662F;&#x201C;&#x6B7B;&#x80E1;&#x540C;&#x201D;&#x3001;&#x54EA;&#x4E9B;&#x662F;&#x65E0;&#x6CD5;&#x4F7F;&#x7528;&#x7684;&#x3001;&#x8FD9;&#x4E9B;&#x662F;&#x975E;&#x5E38;&#x6709;&#x7528;&#x7684;&#x3002;&#x8FC1;&#x79FB;&#x65F6;&#x820D;&#x5F03;&#x7684;&#x6570;&#x636E;&#x81EA;&#x7136;&#x662F;&#x6CA1;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x8FD9;&#x4E9B;&#x201C;&#x6B7B;&#x80E1;&#x540C;&#x201D;&#x6570;&#x636E;&#x548C;&#x4E0E;&#x6B64;&#x76F8;&#x540C;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x8DEF;&#x5F84;&#x7684;&#x6570;&#x636E;&#x5728;&#x8FC1;&#x79FB;&#x8FC7;&#x7A0B;&#x4E2D;&#x90FD;&#x8981;&#x4E22;&#x5F03;&#x3002;
                    </p>
                    <blockquote>
                      <p>
                        That said, there are some additional quick wins that can
                        be gained from data lineage during a migration. In
                        particular, identifying data and report objects where
                        data &#x201C;dead-ends&#x201D; and which are not used is
                        extremely helpful. There is no point in migrating
                        something that is not used. Thus, these
                        &#x201C;dead-end&#x201D; objects and the data lineage
                        pathways to them can be discarded in the migration.
                      </p>
                    </blockquote>
                    <h3
                      id="&#x7528;&#x4F8B;-6&#xFF1A;&#x6570;&#x636E;&#x62A5;&#x544A;&#x5B8C;&#x6574;&#x6027;&#x7684;&#x4FDD;&#x8BC1;"
                    >
                      &#x7528;&#x4F8B;
                      6&#xFF1A;&#x6570;&#x636E;&#x62A5;&#x544A;&#x5B8C;&#x6574;&#x6027;&#x7684;&#x4FDD;&#x8BC1;
                    </h3>
                    <blockquote>
                      <p>Use Case 6 Assurance of Data Integrity in Reports</p>
                    </blockquote>
                    <p>
                      &#x6570;&#x636E;&#x7BA1;&#x7406;&#x5728; 20
                      &#x4E16;&#x7EAA; 90
                      &#x5E74;&#x4EE3;&#x975E;&#x5E38;&#x6D41;&#x884C;&#xFF0C;&#x4F46;&#x5728;
                      21
                      &#x4E16;&#x7EAA;&#x521D;&#x671F;&#x8870;&#x9000;&#x5F97;&#x57FA;&#x672C;&#x6D88;&#x5931;&#x4E86;&#xFF0C;&#x5B83;&#x66F4;&#x662F;&#x6CA1;&#x6709;&#x6210;&#x4E3A;
                      2005
                      &#x5E74;&#x6570;&#x636E;&#x6CBB;&#x7406;&#x9769;&#x547D;&#x7684;&#x91CD;&#x8981;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#xFF0C;&#x5927;&#x6982;&#x539F;&#x56E0;&#x662F;&#x7531;&#x4E8E;&#x6570;&#x636E;&#x7BA1;&#x7406;&#x9AD8;&#x5EA6;&#x4F9D;&#x8D56;&#x624B;&#x5DE5;&#x64CD;&#x4F5C;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x73B0;&#x5728;&#x4E3A;&#x8FD9;&#x7C7B;&#x95EE;&#x9898;&#x63D0;&#x4F9B;&#x4E86;&#x65B0;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x6570;&#x636E;&#x7BA1;&#x7406;&#x95EE;&#x9898;&#x7684;&#x4F8B;&#x5B50;&#x5305;&#x62EC;:
                    </p>
                    <ul>
                      <li>
                        &#x6301;&#x7EED;&#x76D1;&#x63A7;&#x62A5;&#x8868;&#x4E2D;&#x672A;&#x4F7F;&#x7528;&#x5230;&#x7684;&#x6570;&#x636E;&#x8868;&#x548C;
                        ETL
                        &#x6D41;&#x7A0B;&#x3002;&#x8FD9;&#x4E0D;&#x4EC5;&#x662F;&#x4E0A;&#x6587;&#x63D0;&#x5230;&#x7684;&#x6570;&#x636E;&#x8FC1;&#x79FB;&#x7528;&#x4F8B;&#xFF0C;&#x4E5F;&#x662F;&#x6570;&#x636E;&#x7BA1;&#x7406;&#x7684;&#x6301;&#x7EED;&#x6D3B;&#x52A8;&#x3002;
                      </li>
                      <li>
                        &#x53D1;&#x73B0;&#x5E76;&#x7EA0;&#x6B63;&#x5728;&#x6570;&#x636E;&#x8FC1;&#x79FB;&#x8FC7;&#x7A0B;&#x4E2D;&#x7684;&#x4E0D;&#x517C;&#x5BB9;&#x6027;&#x95EE;&#x9898;&#x3002;&#x6BD4;&#x5982;&#x76EE;&#x6807;&#x5217;&#x6BD4;&#x6E90;&#x5217;&#x5C11;&#x3001;&#x6570;&#x636E;&#x53EF;&#x80FD;&#x88AB;&#x622A;&#x65AD;&#x3001;&#x76EE;&#x6807;&#x5217;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x4E0D;&#x4E00;&#x81F4;&#xFF0C;&#x6216;&#x5220;&#x9664;&#x4EC5;&#x5305;&#x542B;&#x6570;&#x5B57;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x7C7B;&#x578B;&#x5217;&#x4E2D;&#x7684;&#x65E0;&#x610F;&#x4E49;&#x524D;&#x7F00;&#x6570;&#x5B57;&#x201D;&#x96F6;&#x201C;&#x3002;
                      </li>
                      <li>
                        &#x81EA;&#x52A8;&#x53D1;&#x73B0;&#x53EF;&#x7591;&#x7684;&#x6570;&#x636E;&#x63D0;&#x53D6;&#xFF0C;&#x5982;&#x201C;&#x79C1;&#x4EBA;&#x201D;&#x6587;&#x4EF6;&#x53EF;&#x80FD;&#x4F1A;&#x7528;&#x4E8E;&#x4E0D;&#x5408;&#x89C4;&#x5730;&#x6570;&#x636E;&#x5904;&#x7406;&#xFF0C;&#x751A;&#x81F3;&#x53EF;&#x80FD;&#x662F;&#x6B3A;&#x8BC8;&#x3002;
                      </li>
                    </ul>
                    <blockquote>
                      <p>
                        In the 1990&#x2019;s Data Administration became very
                        popular, only to largely disappear in the recessions of
                        the early 2000&#x2019;s. It never became a serious
                        component of the Data Governance revolution that began
                        in 2005, probably because of the intensely manual aspect
                        of Data Administration. Yet, data lineage now offers a
                        solution to this problem. Examples of the concerns of
                        Data Administration that data lineage can address
                        include:
                      </p>
                      <ul>
                        <li>
                          Continuously monitoring for tables and ETL processes
                          that are not used in reporting, and go nowhere. This
                          is not just within the context of the migration
                          projects we mentioned earlier but is a continuous
                          activity of Data Administration.
                        </li>
                        <li>
                          Discovering and remediating datatype discrepancies
                          that corrupt data as it flows. A target column may be
                          shorter than a source column, and truncate data. Or a
                          target column may be numeric and remove meaningful
                          leading zeroes from a source column that is character
                          data, but contains only numbers.
                        </li>
                        <li>
                          Discovering suspicious data extracts, such as
                          &#x201C;private&#x201D; files that might be used for
                          ungoverned data processing, or may even possibly be
                          fraudulent.
                        </li>
                      </ul>
                    </blockquote>
                    <p>
                      &#x9664;&#x4E86;&#x4E0A;&#x8FF0;&#x4F8B;&#x5B50;&#x4E4B;&#x5916;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x5728;&#x6570;&#x636E;&#x7BA1;&#x7406;&#x4E2D;&#x8FD8;&#x5B58;&#x5728;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x7528;&#x4F8B;&#x3002;&#x5982;&#x679C;&#x4E0D;&#x4F7F;&#x7528;&#x6570;&#x636E;&#x6CBB;&#x88AD;&#xFF0C;&#x5F88;&#x96BE;&#x5728;&#x6574;&#x4E2A;&#x4F01;&#x4E1A;&#x6570;&#x636E;&#x751F;&#x6001;&#x7CFB;&#x7EDF;&#x7684;&#x5C42;&#x9762;&#x4E0A;&#x5B9E;&#x8D28;&#x6027;&#x89E3;&#x51B3;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x3002;
                    </p>
                    <blockquote>
                      <p>
                        There are actually a wide range of use cases that exist
                        within Data Administration in addition to these
                        examples. Without data lineage it is difficult to see
                        how these could be meaningfully addressed at the scale
                        of an entire enterprise data ecosystem.
                      </p>
                    </blockquote>
                    <h2
                      id="&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x81EA;&#x52A8;&#x5316;&#x626E;&#x6F14;&#x7684;&#x89D2;&#x8272;"
                    >
                      &#x6570;&#x636E;&#x6CBF;&#x88AD;&#x81EA;&#x52A8;&#x5316;&#x626E;&#x6F14;&#x7684;&#x89D2;&#x8272;
                    </h2>
                    <blockquote>
                      <p>The Role of Automated Data Lineage</p>
                    </blockquote>
                    <p>
                      &#x6B64;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x89E3;&#x91CA;&#x4E86;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x6982;&#x5FF5;&#xFF0C;&#x5E76;&#x5217;&#x4E3E;&#x4E86;&#x4E00;&#x7CFB;&#x5217;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x573A;&#x666F;&#x7528;&#x4F8B;&#x6765;&#x6F14;&#x793A;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x4EBA;&#x4EEC;&#x5F88;&#x81EA;&#x7136;&#x5730;&#x4F1A;&#x95EE;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x5728;&#x5B9E;&#x9645;&#x5DE5;&#x4F5C;&#x4E2D;&#x662F;&#x5982;&#x4F55;&#x5B8C;&#x6210;&#x7684;&#x3002;
                    </p>
                    <blockquote>
                      <p>
                        At this point, we have described what data lineage is
                        and illustrated it with a set of use cases where it is
                        particularly valuable. However, it is natural to ask how
                        data lineage actually gets done.
                      </p>
                    </blockquote>
                    <p>
                      &#x4F20;&#x7EDF;&#x6A21;&#x5F0F;&#x4E2D;&#xFF0C;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x5728;
                      IT
                      &#x5F00;&#x53D1;&#x5DE5;&#x4F5C;&#x671F;&#x95F4;&#x6709;&#x65F6;&#x5DF2;&#x7ECF;&#x88AB;&#x8BB0;&#x5F55;&#x4E0B;&#x6765;&#x4E86;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x5373;&#x4F7F;&#x5C1D;&#x8BD5;&#x8BB0;&#x5F55;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x4E5F;&#x662F;&#x767D;&#x8D39;&#x529B;&#x6C14;&#xFF0C;&#x6BD4;&#x5982;&#x73AF;&#x5883;&#x53D1;&#x751F;&#x53D8;&#x5316;&#x65F6;&#xFF0C;&#x6587;&#x6863;&#x5374;&#x4E0D;&#x4F1A;&#x81EA;&#x52A8;&#x66F4;&#x65B0;&#x3002;&#x5982;&#x679C;&#x5BF9;&#x6587;&#x4EF6;&#x4FE1;&#x606F;&#x7684;&#x51C6;&#x786E;&#x6027;&#x6301;&#x6709;&#x6000;&#x7591;&#x65F6;&#xFF0C;&#x90A3;&#x4E48;&#x6240;&#x6709;&#x76F8;&#x5173;&#x7684;&#x6587;&#x4EF6;&#x4FE1;&#x606F;&#x90FD;&#x662F;&#x53EF;&#x7591;&#x7684;&#xFF0C;&#x81EA;&#x7136;&#x6CA1;&#x6709;&#x4EBA;&#x76F8;&#x4FE1;&#x5B83;&#x3002;
                    </p>
                    <blockquote>
                      <p>
                        Traditionally, it has been documented during IT
                        development efforts &#x2013; at least sometimes. Even
                        where there are attempts to document data lineage, they
                        are nearly always wasted effort. The environment
                        evolves, but the documentation is usually not updated.
                        And if there is even the slightest suspicion of the
                        accuracy of the documentation, then all of it is
                        suspect, and nobody trusts it.
                      </p>
                    </blockquote>
                    <p>
                      &#x4F20;&#x7EDF;&#x6A21;&#x5F0F;&#x91CC;&#x6211;&#x4EEC;&#x4E0D;&#x5F97;&#x4E0D;&#x624B;&#x5DE5;&#x8FFD;&#x8E2A;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x2014;&#x2014;&#x8FFD;&#x8E2A;&#x9891;&#x7387;&#x5F88;&#x9AD8;&#x3002;
                    </p>
                    <blockquote>
                      <p>
                        Traditionally, this has left us with manual efforts to
                        trace data lineage whenever the need arises &#x2013;
                        which is pretty frequent.
                      </p>
                    </blockquote>
                    <p>
                      &#x8FD9;&#x4E9B;&#x624B;&#x5DE5;&#x8FFD;&#x8E2A;&#x6570;&#x636E;&#x975E;&#x5E38;&#x6709;&#x4EF7;&#x503C;&#xFF0C;&#x4F46;&#x5BB9;&#x6613;&#x51FA;&#x9519;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x8BA9;&#x6240;&#x6709;&#x76F8;&#x5173;&#x7684;&#x4EBA;&#x5458;&#x611F;&#x5230;&#x6CAE;&#x4E27;&#x3002;&#x4F46;&#x662F;&#x73B0;&#x5728;&#xFF0C;&#x6709;&#x4E86;&#x66FF;&#x4EE3;&#x65B9;&#x6848;&#x2014;&#x2014;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x81EA;&#x52A8;&#x53D1;&#x73B0;&#x3002;
                    </p>
                    <blockquote>
                      <p>
                        These manual efforts are costly, error-prone, and
                        frustrating to all involved. But today, there is an
                        alternative &#x2013; automated data lineage discovery.
                      </p>
                    </blockquote>
                    <p>
                      &#x6570;&#x636E;&#x6CBF;&#x88AD;&#x81EA;&#x52A8;&#x53D1;&#x73B0;&#x5DE5;&#x5177;&#x7684;&#x7ED3;&#x679C;&#x5341;&#x5206;&#x51C6;&#x786E;&#xFF0C;&#x5176;&#x539F;&#x56E0;&#x5982;&#x4E0B;&#xFF1A;
                    </p>
                    <blockquote>
                      <p>
                        The tools that enable automated data lineage address the
                        use cases described above very effectively, for the
                        following reasons: Automated data lineage tools scale
                        well. Very often there are not enough technical IT staff
                        to do manual data lineage work. Automated data lineage
                        tools are accurate. Manual effort is error-prone, and
                        different analysts may document data lineage differently
                        leading to interpretation problems. Automated data
                        lineage tools deal well with complexity. Even moderately
                        sized enterprises have a huge number of columns and ETL
                        processes in their data landscapes. Automated data
                        lineage tools are very fast. They can scan huge
                        environments and produce data lineage diagrams in just
                        minutes. It would take humans between several days to
                        several months to do the same work. As we have seen,
                        there are use cases where answers about data lineage are
                        needed immediately.
                      </p>
                    </blockquote>
                    <p>
                      &#x6570;&#x636E;&#x6CBF;&#x88AD;&#x81EA;&#x52A8;&#x53D1;&#x73B0;&#x5DE5;&#x5177;&#x6709;&#x826F;&#x597D;&#x7684;&#x53EF;&#x6269;&#x5C55;&#x6027;&#x3002;&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0D;&#x4F1A;&#x5206;&#x914D;&#x8DB3;&#x591F;&#x7684;&#x6280;&#x672F;
                      IT
                      &#x4EBA;&#x5458;&#x6765;&#x5B8C;&#x6210;&#x624B;&#x5DE5;&#x8FFD;&#x8E2A;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x7684;&#x5DE5;&#x4F5C;&#x3002;
                    </p>
                    <p>
                      &#x6570;&#x636E;&#x6CBF;&#x88AD;&#x81EA;&#x52A8;&#x53D1;&#x73B0;&#x5DE5;&#x5177;&#x5904;&#x7406;&#x7ED3;&#x679C;&#x51C6;&#x786E;&#x4E00;&#x81F4;&#x3002;&#x624B;&#x5DE5;&#x64CD;&#x4F5C;&#x5F88;&#x5BB9;&#x6613;&#x51FA;&#x9519;&#xFF0C;&#x800C;&#x4E14;&#x4E0D;&#x540C;&#x7684;&#x5206;&#x6790;&#x5E08;&#x53EF;&#x80FD;&#x4EE5;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x5F0F;&#x8BB0;&#x5F55;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#xFF0C;&#x4ECE;&#x800C;&#x5EF6;&#x4F38;&#x51FA;&#x4E0D;&#x540C;&#x7684;&#x95EE;&#x9898;&#x89E3;&#x91CA;&#x903B;&#x8F91;&#x3002;
                    </p>
                    <p>
                      &#x6570;&#x636E;&#x6CBF;&#x88AD;&#x81EA;&#x52A8;&#x53D1;&#x73B0;&#x5DE5;&#x5177;&#x53EF;&#x5904;&#x7406;&#x590D;&#x6742;&#x6027;&#x573A;&#x666F;&#x3002;&#x5373;&#x4F7F;&#x4E2D;&#x7B49;&#x89C4;&#x6A21;&#x7684;&#x4F01;&#x4E1A;&#x5728;&#x5176;&#x6570;&#x636E;&#x573A;&#x666F;&#x4E2D;&#x4E5F;&#x6709;&#x5927;&#x91CF;&#x7684;&#x6570;&#x636E;&#x5217;&#x548C;
                      ETL
                      &#x6D41;&#x7A0B;&#xFF0C;&#x975E;&#x4EBA;&#x5DE5;&#x64CD;&#x4F5C;&#x53EF;&#x4EE5;&#x5B8C;&#x6210;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x5DE5;&#x4F5C;&#x3002;
                    </p>
                    <p>
                      &#x6570;&#x636E;&#x6CBF;&#x88AD;&#x81EA;&#x52A8;&#x53D1;&#x73B0;&#x5DE5;&#x5177;&#x62DB;&#x724C;&#x901F;&#x5EA6;&#x975E;&#x5E38;&#x9AD8;&#x6548;&#x3002;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x626B;&#x63CF;&#x5927;&#x89C4;&#x6A21;&#x7684;
                      IT
                      &#x73AF;&#x5883;&#xFF0C;&#x5E76;&#x5728;&#x51E0;&#x5206;&#x949F;&#x5185;&#x751F;&#x6210;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x56FE;&#x8C31;&#x3002;&#x540C;&#x6837;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x624B;&#x5DE5;&#x64CD;&#x4F5C;&#x7684;&#x8BDD;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x51E0;&#x5929;&#x751A;&#x81F3;&#x51E0;&#x4E2A;&#x6708;&#x7684;&#x65F6;&#x95F4;&#x624D;&#x80FD;&#x5B8C;&#x6210;&#x3002;&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x6240;&#x770B;&#x5230;&#x7684;&#xFF0C;&#x5728;&#x4E00;&#x4E9B;&#x7528;&#x4F8B;&#x573A;&#x666F;&#x4E2D;&#xFF0C;&#x9700;&#x8981;&#x7ACB;&#x5373;&#x5E94;&#x7B54;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x76F8;&#x5173;&#x7684;&#x95EE;&#x9898;&#x3002;
                    </p>
                    <p>
                      IT
                      &#x7ECF;&#x7406;&#x548C;&#x6267;&#x884C;&#x53D1;&#x8D77;&#x4EBA;&#x6709;&#x65F6;&#x4F1A;&#x9519;&#x8BEF;&#x5730;&#x91C7;&#x7528;&#x8FD9;&#x6837;&#x4E00;&#x79CD;&#x89C2;&#x70B9;&#xFF0C;&#x5373;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x7684;&#x9700;&#x6C42;&#x662F;&#x975E;&#x5E38;&#x65AD;&#x65AD;&#x7EED;&#x7EED;&#x7684;&#x2014;&#x2014;&#x5C31;&#x50CF;&#x8FC1;&#x79FB;&#x9879;&#x76EE;&#x4E00;&#x6837;&#x2014;&#x2014;&#x90A3;&#x4E48;&#x4ED6;&#x4EEC;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x6295;&#x8D44;&#x4E00;&#x4E2A;&#x6309;&#x5E74;&#x5EA6;&#x8BB8;&#x53EF;&#x8BC1;&#x6536;&#x53D6;&#x8D39;&#x7528;&#x7684;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x81EA;&#x52A8;&#x5316;&#x5DE5;&#x5177;&#x5462;&#xFF1F;&#x4ED6;&#x4EEC;&#x8BA4;&#x4E3A;&#x5728;&#x9879;&#x76EE;&#x9700;&#x8981;&#x65F6;&#x518D;&#x8058;&#x8BF7;&#x6570;&#x636E;&#x987E;&#x95EE;&#x624B;&#x5DE5;&#x8BB0;&#x5F55;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x2014;&#x2014;&#x5373;&#x5355;&#x6B21;&#x7684;&#x6570;&#x636E;&#x670D;&#x52A1;&#x6210;&#x672C;&#x3002;&#x4E0A;&#x8FF0;&#x8BA8;&#x8BBA;&#x7684;&#x7528;&#x4F8B;&#x573A;&#x666F;&#x8868;&#x660E;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x975E;&#x5E38;&#x77ED;&#x89C6;&#x7684;&#x89C2;&#x70B9;&#xFF0C;&#x4F01;&#x4E1A;&#x5E94;&#x8BE5;&#x4E3A;&#x6838;&#x5FC3;&#x7684;&#x7528;&#x4F8B;&#x573A;&#x666F;&#x548C;&#x9700;&#x8981;&#x5FEB;&#x901F;&#x89E3;&#x51B3;&#x6570;&#x636E;&#x95EE;&#x9898;&#x7684;&#x7528;&#x4F8B;&#x573A;&#x666F;&#x91C7;&#x8D2D;&#x4E00;&#x5957;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x81EA;&#x52A8;&#x5316;&#x5DE5;&#x5177;&#xFF0C;&#x8FD9;&#x624D;&#x662F;
                      2022
                      &#x5E74;&#x53CA;&#x4EE5;&#x540E;&#x5927;&#x591A;&#x6570;&#x4F01;&#x4E1A;&#x9762;&#x4E34;&#x7684;&#x51B3;&#x7B56;&#x95EE;&#x9898;&#x3002;
                    </p>
                    <blockquote>
                      <p>
                        IT managers and executive sponsors sometimes make the
                        mistake of adopting a viewpoint that the need for data
                        lineage is very intermittent &#x2013; like migrations
                        projects - so why should they invest in an automated
                        data lineage tool that will eat up recurrent annual
                        license fees? Sometimes they think it is better to hire
                        consultants to document the data lineage manually when
                        it is needed &#x2013; a one-time cost. The use cases
                        discussed earlier show that this is a short-sighted view
                        and an automated data lineage tool needs to be on hand
                        for the use cases that are permanent in nature, and
                        others where a rapid response is needed. That really is
                        the situation for most enterprises as they face 2022 and
                        beyond.
                      </p>
                    </blockquote>
                    <h2 id="&#x7ED3;&#x8BBA;">&#x7ED3;&#x8BBA;</h2>
                    <blockquote>
                      <p>Conclusion</p>
                    </blockquote>
                    <p>
                      &#x672C;&#x6587;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x8BE6;&#x7EC6;&#x63CF;&#x8FF0;&#x4E86;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x6982;&#x5FF5;&#x5E76;&#x5217;&#x4E3E;&#x4E86;&#x51E0;&#x4E2A;&#x6838;&#x5FC3;&#x7528;&#x4F8B;&#x573A;&#x666F;&#x3002;&#x6211;&#x4EEC;&#x4ECE;
                      IT
                      &#x89D2;&#x5EA6;&#x548C;&#x6570;&#x636E;&#x6CBB;&#x7406;&#x89D2;&#x5EA6;&#x770B;&#x5230;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x53D1;&#x6325;&#x7684;&#x4F5C;&#x7528;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x7684;&#x91CD;&#x8981;&#x6027;&#x548C;&#x4EF7;&#x503C;&#x8FDC;&#x8FDC;&#x8D85;&#x51FA;&#x4E86;&#x6211;&#x4EEC;&#x4E0A;&#x8FF0;&#x63CF;&#x8FF0;&#x7684;&#x6570;&#x636E;&#x8D28;&#x91CF;&#x573A;&#x666F;&#xFF08;&#x4F8B;&#x5982;&#x6E90;&#x76EE;&#x6807;&#x534F;&#x8C03;&#xFF09;&#x3001;&#x4E3B;&#x6570;&#x636E;&#x7BA1;&#x7406;&#x573A;&#x666F;&#xFF08;&#x4F8B;&#x5982;&#x6D41;&#x5165;&#x96C6;&#x6210;&#x6D41;&#x7A0B;&#xFF09;&#x548C;&#x6570;&#x636E;&#x6CBB;&#x7406;&#x7684;&#x5176;&#x4ED6;&#x65B9;&#x9762;(&#x4F8B;&#x5982;&#x9009;&#x62E9;&#x6700;&#x597D;&#x7684;&#x6570;&#x636E;&#x6765;&#x6E90;)&#x3002;&#x6211;&#x4EEC;&#x4E5F;&#x770B;&#x5230;&#x4E86;&#x91C7;&#x7528;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x4F1A;&#x9047;&#x5230;&#x7684;&#x969C;&#x788D;&#xFF0C;&#x6BD4;&#x5982;:
                    </p>
                    <ul>
                      <li>
                        &#x6570;&#x636E;&#x6CBF;&#x88AD;&#x81EA;&#x52A8;&#x53D1;&#x73B0;&#x6982;&#x5FF5;&#x4F9D;&#x8D56;&#x7684;&#x4E1A;&#x52A1;&#x9700;&#x6C42;&#x5E76;&#x4E0D;&#x5E38;&#x89C1;
                      </li>
                      <li>
                        IT
                        &#x4E1A;&#x754C;&#x8FC7;&#x5F80;&#x5BF9;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x7684;&#x504F;&#x89C1;&#xFF0C;&#x8BA4;&#x4E3A;&#x5B83;&#x662F;&#x4E0D;&#x5207;&#x5B9E;&#x9645;&#x7684;&#xFF0C;&#x4E5F;&#x4ECE;&#x672A;&#x8BA8;&#x8BBA;&#x8FC7;&#x5982;&#x4F55;&#x843D;&#x5730;
                      </li>
                      <li>
                        &#x7F3A;&#x4E4F;&#x5BF9;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x7528;&#x4F8B;&#x573A;&#x666F;&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x590D;&#x6742;&#x95EE;&#x9898;&#x7B80;&#x5355;&#x5316;&#x5904;&#x7406;&#x4E86;&#xFF08;&#x4E3A;&#x4E86;&#x586B;&#x5751;&#x53C8;&#x6316;&#x4E86;&#x53E6;&#x4E00;&#x4E2A;&#x5751;&#xFF09;
                        <blockquote>
                          <p>
                            In this eBook we have described data lineage in
                            detail with illustrations from several core use
                            cases. We have seen how useful it can be from an IT
                            perspective and a Data Governance perspective. In
                            fact, the importance and value of data lineage goes
                            well beyond what we have described as it is needed
                            to successfully address Data Quality (e.g.
                            source-target reconciliation), Master Data
                            Management (e.g. flows into integration processes),
                            and other aspects of Data Governance (e.g. selecting
                            the best source of data). We have also seen barriers
                            to adoption, including:
                          </p>
                          <ul>
                            <li>
                              The perception that automated data lineage is
                              needed on an infrequent basis
                            </li>
                            <li>
                              Inertia in IT based on data lineage being
                              impractical in the past, and so never discussed
                            </li>
                            <li>
                              A lack of understanding of the use cases due to
                              the problems they solve simply being ignored
                            </li>
                          </ul>
                        </blockquote>
                      </li>
                    </ul>
                    <p>
                      &#x7136;&#x800C;&#xFF0C;&#x6211;&#x4EEC;&#x5F88;&#x6E05;&#x695A;&#x5730;&#x660E;&#x767D;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x81EA;&#x52A8;&#x5316;&#x7684;&#x4EF7;&#x503C;&#x3002;&#x56DE;&#x5230;&#x6211;&#x4EEC;&#x7684;&#x70BC;&#x6CB9;&#x5382;&#x7684;&#x7528;&#x4F8B;&#x573A;&#x666F;&#xFF0C;&#x6CA1;&#x6709;&#x8BBE;&#x5907;&#x4EFB;&#x4F55;&#x70BC;&#x6CB9;&#x5382;&#x90FD;&#x65E0;&#x6CD5;&#x8FD0;&#x884C;&#xFF0C;&#x66F4;&#x65E0;&#x6CD5;&#x4E86;&#x89E3;&#x5728;&#x67D0;&#x4E00;&#x65F6;&#x523B;&#x5B83;&#x7684;&#x8FD0;&#x884C;&#x6570;&#x636E;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x4E0D;&#x4E86;&#x89E3;&#x70BC;&#x6CB9;&#x5382;&#x8FD0;&#x884C;&#x7684;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x5730;&#x56FE;&#xFF0C;&#x6211;&#x4EEC;&#x51ED;&#x4EC0;&#x4E48;&#x671F;&#x671B;&#x4E00;&#x4E2A;&#x590D;&#x6742;&#x7684;&#x6570;&#x636E;&#x73AF;&#x5883;&#x80FD;&#x591F;&#x6709;&#x6548;&#x5730;&#x8FD0;&#x4F5C;&#xFF0C;&#x4ECE;&#x4E1A;&#x52A1;&#x7B56;&#x7565;&#x3001;&#x64CD;&#x4F5C;&#x6548;&#x7387;&#x548C;&#x98CE;&#x9669;&#x7F13;&#x89E3;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x8FD9;&#x5F20;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x5730;&#x56FE;&#x662F;&#x5341;&#x5206;&#x5FC5;&#x8981;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x5B83;&#x6B63;&#x662F;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x81EA;&#x52A8;&#x5316;&#x5DE5;&#x5177;&#x6240;&#x63D0;&#x4F9B;&#x7684;&#x3002;&#x4E5F;&#x8BB8;&#x5728;&#x6211;&#x4EEC;&#x5217;&#x51FA;&#x7684;&#x6240;&#x6709;&#x7528;&#x4F8B;&#x4E2D;&#xFF0C;&#x6700;&#x5177;&#x6709;&#x6218;&#x7565;&#x610F;&#x4E49;&#x7684;&#x662F;&#x7B2C;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x8FC1;&#x79FB;&#x7684;&#x7528;&#x4F8B;&#xFF0C;&#x901A;&#x8FC7;&#x91CD;&#x65B0;&#x8BBE;&#x8BA1;&#x4E1A;&#x52A1;&#x6D41;&#x7A0B;&#x6765;&#x5339;&#x914D;&#x4E1A;&#x52A1;&#x76EE;&#x6807;&#x3002;&#x6218;&#x672F;&#x4E0A;&#x6700;&#x6709;&#x7528;&#x7684;&#x53EF;&#x80FD;&#x662F;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x7528;&#x4F8B;&#xFF0C;&#x5B83;&#x80FD;&#x591F;&#x5FEB;&#x901F;&#x8BCA;&#x65AD;&#x662F;&#x4EC0;&#x4E48;&#x5F71;&#x54CD;&#x4E86;
                      ETL
                      &#x4F5C;&#x4E1A;&#x7684;&#x8FD0;&#x884C;&#x3002;&#x5F52;&#x6839;&#x7ED3;&#x5E95;&#xFF0C;&#x6211;&#x4EEC;&#x5217;&#x4E3E;&#x8FD9;&#x4E48;&#x591A;&#x7684;&#x7528;&#x4F8B;&#x573A;&#x666F;&#x7EC4;&#x5408;&#x662F;&#x4E3A;&#x4E86;&#x7ED9;&#x4F01;&#x4E1A;&#x91C7;&#x8D2D;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x81EA;&#x52A8;&#x5316;&#x5DE5;&#x5177;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x5145;&#x8DB3;&#x7684;&#x7406;&#x7531;&#x3002;&#x4E8B;&#x5B9E;&#x672C;&#x662F;&#x5982;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x671F;&#x5F85;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#x5DE5;&#x5177;&#x5728;
                      2022
                      &#x5E74;&#x88AB;&#x5E7F;&#x6CDB;&#x91C7;&#x7528;&#x3002;
                    </p>
                    <blockquote>
                      <p>
                        Yet we have also clearly demonstrated the value of
                        automated data lineage. Going back to our oil refinery
                        metaphor, no refinery could operate without the
                        instrumentation to understand what is happening in it at
                        any time. Why should we expect a complex data
                        environment to function efficiently and without risk if
                        we do not even have a map of how it is laid out? From a
                        perspective of business strategy, operational
                        efficiency, and risk mitigation this map is needed and
                        it is precisely what an automated data lineage tool
                        provides. Perhaps of all the use cases, we have laid
                        out, the most strategic is the first one wherein
                        migrations the opportunity exists to reengineer business
                        processes to match business objectives. The most
                        tactically useful is perhaps the last one, with the
                        ability to quickly diagnose what broke an ETL process.
                        Yet the combination of all of the use cases we have
                        described provides an overwhelming justification for the
                        acquisition of an automated data lineage tool. So
                        overwhelming in fact that we can expect widespread
                        adoption of these tools in 2022.
                      </p>
                    </blockquote>
                  </section>
                </div>
                <div class="search-results">
                  <div class="has-results">
                    <h1 class="search-results-title">
                      <span class="search-results-count"></span> results
                      matching "<span class="search-query"></span>"
                    </h1>
                    <ul class="search-results-list"></ul>
                  </div>
                  <div class="no-results">
                    <h1 class="search-results-title">
                      No results matching "<span class="search-query"></span>"
                    </h1>
                  </div>
                </div>
              </div>
            </div>
          </div>
        </div>
      </div>

      <script>
        var gitbook = gitbook || [];
        gitbook.push(function () {
          gitbook.page.hasChanged({
            page: {
              title: "数据沿袭基本指南(2022 年)",
              level: "1.2.1",
              depth: 2,
              next: {
                title: "在线图书",
                level: "1.3",
                depth: 1,
                ref: "",
                articles: [
                  {
                    title: "自然语言处理入门",
                    level: "1.3.1",
                    depth: 2,
                    url: "https://introduction-nlp.book.jaden.tech/",
                    ref: "https://introduction-nlp.book.jaden.tech/",
                    articles: [],
                  },
                  {
                    title: "利用 Python 进行数据分析[第 2 版]",
                    level: "1.3.2",
                    depth: 2,
                    url: "https://python-for-data-analysis-2nd.book.jaden.tech/",
                    ref: "https://python-for-data-analysis-2nd.book.jaden.tech/",
                    articles: [],
                  },
                ],
              },
              previous: {
                title: "文字杂录",
                level: "1.2",
                depth: 1,
                ref: "",
                articles: [
                  {
                    title: "数据沿袭基本指南(2022 年)",
                    level: "1.2.1",
                    depth: 2,
                    path: "posts/2022/The-Essential-Guide-to-DATA-LINEAGE-IN-2022.md",
                    ref: "posts/2022/The-Essential-Guide-to-DATA-LINEAGE-IN-2022.md",
                    articles: [],
                  },
                ],
              },
              dir: "ltr",
            },
            config: {
              gitbook: "*",
              theme: "default",
              variables: {},
              plugins: [],
              pluginsConfig: {
                highlight: {},
                search: {},
                lunr: { maxIndexSize: 1000000, ignoreSpecialCharacters: false },
                sharing: {
                  facebook: true,
                  twitter: true,
                  google: false,
                  weibo: false,
                  instapaper: false,
                  vk: false,
                  all: ["facebook", "google", "twitter", "weibo", "instapaper"],
                },
                fontsettings: { theme: "white", family: "sans", size: 2 },
                "theme-default": {
                  styles: {
                    website: "styles/website.css",
                    pdf: "styles/pdf.css",
                    epub: "styles/epub.css",
                    mobi: "styles/mobi.css",
                    ebook: "styles/ebook.css",
                    print: "styles/print.css",
                  },
                  showLevel: false,
                },
              },
              structure: {
                langs: "LANGS.md",
                readme: "README.md",
                glossary: "GLOSSARY.md",
                summary: "SUMMARY.md",
              },
              pdf: {
                pageNumbers: true,
                fontSize: 12,
                fontFamily: "Arial",
                paperSize: "a4",
                chapterMark: "pagebreak",
                pageBreaksBefore: "/",
                margin: { right: 62, left: 62, top: 56, bottom: 56 },
              },
              styles: {
                website: "styles/website.css",
                pdf: "styles/pdf.css",
                epub: "styles/epub.css",
                mobi: "styles/mobi.css",
                ebook: "styles/ebook.css",
                print: "styles/print.css",
              },
            },
            file: {
              path: "posts/2022/The-Essential-Guide-to-DATA-LINEAGE-IN-2022.md",
              mtime: "2022-02-26T15:40:56.386Z",
              type: "markdown",
            },
            gitbook: { version: "3.2.3", time: "2022-02-26T15:41:51.807Z" },
            basePath: "../..",
            book: { language: "" },
          });
        });
      </script>
    </div>

    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>

    <script src="../../gitbook/gitbook-plugin-search/search-engine.js"></script>

    <script src="../../gitbook/gitbook-plugin-search/search.js"></script>

    <script src="../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>

    <script src="../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>

    <script src="../../gitbook/gitbook-plugin-sharing/buttons.js"></script>

    <script src="../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
  </body>
</html>
